Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
// ============================================================================
//  Zegar NTP RLCD v8.0 — wzorcowy refaktor architektury (funkcjonalnie = v7.0)
//
//  ZASADA NACZELNA: zachowanie identyczne z v7.0 co do bajta (NVS, HTML, rejestry,
//  kolejnosc operacji, timingi). Zmiany dotycza WYLACZNIE struktury kodu.
//
//  Zmiany v8.0 (architektura i jakosc):
//   [ARCHITEKTURA]
//    - lekki Dependency Injection: sprzet (Wire, panel, WebServer, Preferences,
//      dekoder Audio, kodek) wstrzykiwany referencjami w konstruktorach — klasy
//      logiki nie siegaja po globalne singletony; okablowanie widoczne w App,
//    - RtcController uniezalezniony od App (czysty sterownik: tylko TwoWire&),
//    - SettingsStore jedynym wlascicielem NVS (zapis dobowego podsumowania baterii
//      przeniesiony z BatteryMonitor); sesje Preferences pod straznikiem RAII
//      (NvsSession) — kazdy wczesny return domyka NVS,
//    - separacja UI/logiki: ClockView (model widoku) — render i anty-mruganie
//      pracuja na tych samych danych liczonych RAZ (v7.0 liczyl najblizszy budzik
//      dwukrotnie na repaint),
//    - DisplayUi::update() jako dispatcher po enum class UiPage (jawna hierarchia
//      stron: Ringing > Preview > NoTime > Clock),
//    - jedna klasa DebouncedButton (maszyna stanow debounce+pomiar nacisniecia)
//      zamiast dwoch recznych debouncerow; polityka krotki/dlugi w ButtonInput,
//    - wspolne zejscie do deep-sleep PowerPlanner::beginDeepSleep() (noc + ochrona
//      ogniwa) — sekwencja usypiania istnieje w JEDNYM egzemplarzu,
//    - klasyfikacja przyczyny wybudzenia w POD WakeInfo (jedno miejsce, testowalne).
//   [NOWOCZESNE C++ / CZYTELNOSC]
//    - enum class: NtpState, SyncTrigger, ButtonEvent, UiPage, StopCause, FsBackend,
//    - cala konfiguracja w przestrzeniach constexpr (pins/lcd/i2cbus/pcf85063/
//      es8311/rtccfg/batcfg/alarmcfg/ntpcfg/powercfg/btncfg/webcfg/fscfg/nvskeys)
//      — zero magicznych liczb w logice; piny jako gpio_num_t (bez rzutowan),
//    - rejestry i bity PCF85063A oraz ES8311 nazwane wg datasheetow,
//    - std::array dla tablic konfiguracyjnych i budzikow (+static_assert zgodnosci
//      rozmiaru bloba NVS "alarms" z v7.x),
//    - static_assert pilnuje trywialnosci PersistentState (RTC_DATA_ATTR) —
//      przypadkowy konstruktor kasowalby stan po kazdym wybudzeniu,
//    - estymator zuzycia jako metody struktury DrainEstimator (POD) — znika hack
//      forward-deklaracji pod auto-prototypy Arduino.
//   [MARTWY KOD — USUNIETE]
//    - no-op st7305SetStaticLowPower + flaga ST7305_STATIC_LPM, nieuzywany parametr
//      coldBoot w setupie ekranu, nieuzywana App& w RtcManager, martwe akcesory
//      (FileStore::mounted, App::lastAlarmCheckMs), nieuzywane stale BATTERY_
//      EMPTY/FULL_VOLTAGE, trwale martwa galaz POWER_DOWN_FLASH_IN_SLEEP
//      (ostrzezenie sprzetowe zostalo jako komentarz przy light-sleep).
//   [DEDUPLIKACJA]
//    - failNtpAttempt() (2 identyczne sciezki porazki NTP), wifiPowerOff(),
//      copyBounded() (3 warianty kopiowania poswiadczen), removeIfExists() +
//      discardUploadTemp() (7x exists/remove w uploadzie MP3), nextOccurrence()
//      (3x wzorzec "dzis albo jutro"), extendWindow() (6x przedluzenie okna WWW),
//      amplifierOff() (3x pinMode+LOW), sentinel repaintu w jednej stalej.
//   [POPRAWKI BLEDOW ODZIEDZICZONYCH PO v7.0 — jedyne swiadome zmiany zachowania]
//    1. rollback czasu po nieudanym NTP cofal zegar systemowy o czas trwania
//       proby (do ~50 s), mimo ze zaden pakiet nie zmodyfikowal zegara — teraz
//       przywracamy czas TYLKO gdy pakiet faktycznie wszedl (g_ntpGotPacket),
//    2. sweep "kolizji DST" w checkAlarms oznaczal jako wyzwolone WSZYSTKIE
//       budziki wymagalne w oknie spoznienia (przy oknie 90 s po korekcie NTP
//       drugi budzik znikal bez dzwieku) — teraz konsumowane sa wylacznie
//       budziki o IDENTYCZNEJ chwili wystapienia (prawdziwa kolizja),
//    3. budzik, ktorego termin wypadl PODCZAS dzwonienia innego, ginal po 20 s
//       okna — teraz trafia do kolejki i dzwoni zaraz po wyciszeniu/zakonczeniu,
//    4. poranna synchronizacja 06:00 zyla tylko w setup() — urzadzenie czuwajace
//       przez 06:00 (dzwoniacy budzik, otwarte WWW) gubilo ja na caly dzien —
//       przeniesiona do checkSchedule() (dziala tez w trybie oszczedzania:
//       obejmuje ja teraz bramka niskiej baterii, spojnie z oknem 18:00),
//    5. zimny start z wcisnietym KEY: zwolnienie po dowolnie dlugim przytrzymaniu
//       odpalalo akcje krotka (panel WWW) — begin() uzbraja pomiar nacisniecia,
//       wiec kontrakt "dlugi KEY = nic" obowiazuje takze od pierwszego zwolnienia,
//    6. busy-wait wyrownania fazy w zapisie RTC: arytmetyka w int64, watchdogFeed
//       w petli i twarde przerwanie zapisu przy rownoleglym skoku czasu (SNTP).
//   Pozostale inwarianty czasu/energii/RTC/NTP/sleep przeniesione 1:1 z v7.0
//   (opisane przy definicjach). Klucze NVS w namespace "zegar7" bez zmian —
//   budziki, WiFi i wykalibrowany offset RTC przezywaja aktualizacje firmware.
//
//  Historia v7.x (skrot): v7.0 autokalibracja offsetu RTC z pomiaru fazowego NTP
//  (dryf resztkowy ~±0.19 s/dobe), CPU 80 MHz w dzien / 160 MHz przy audio,
//  odzysk zawieszonej szyny I2C, NTP fail-fast po zerwaniu WiFi; v7.0 porzadki.
//
//  Sprzet: Waveshare ESP32-S3-RLCD-4.2 (ST7305 refleksyjny 400x300 landscape,
//          ES8311 audio codec, PCF85063A RTC). Zasilanie: 1x Samsung INR18650-35E.
//  Arduino IDE: plytka "ESP32S3 Dev Module", Flash 8MB, partycja "8M with spiffs".
//  Pliki obok .ino: photo_font.h  (+ MP3 budzikow na partycji danych: /alarm1..3.mp3)
//  Biblioteki: U8g2 (>=2.35), ESP32 core 3.x, ESP32-audioI2S 3.4.5.
// ============================================================================
// ============================================================================
//  [1] INCLUDES
// ============================================================================
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <Wire.h>
#include <atomic>
#include <array>
#include <type_traits>
#include <ctype.h>
#include <limits.h>
#include <time.h>
#include <sys/time.h>
#include <FS.h>
#include <SPIFFS.h>
#include <LittleFS.h>
#include <FFat.h>
#include <U8g2lib.h>
#include <SPI.h>
#include <Audio.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#include <driver/rtc_io.h>
#include "esp_sntp.h"
#include "esp_task_wdt.h"
#include "esp_system.h"

#include "photo_font.h"

// ============================================================================
//  [2] WERSJA, BUILD INFO, FLAGI FUNKCJI
// ============================================================================
#define FW_NAME        "Zegar NTP RLCD"
#define FW_VERSION     "8.0"
#define FW_BUILD_DATE  __DATE__
#define FW_BUILD_TIME  __TIME__

