Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
// Unikalny klucz doby lokalnej (rok*400+dzien roku) — dedup zdarzen "raz na dobe".
static int localDayKey(const struct tm &t) {
  return (t.tm_year + 1900) * 400 + t.tm_yday;
}

static bool isNightMode(const struct tm &t) {
  int now = t.tm_hour * 60 + t.tm_min;
  int start = powercfg::NIGHT_START_HOUR * 60 + powercfg::NIGHT_START_MIN;
  int end   = powercfg::NIGHT_END_HOUR * 60 + powercfg::NIGHT_END_MIN;
  if (start < end) return now >= start && now < end;
  if (start > end) return now >= start || now < end;
  return false;
}

// Zakres epok akceptowany jako "prawdziwy czas" (odrzuca 1970 po resecie i smieci).
constexpr time_t MIN_VALID_EPOCH = 1700000000;   // 2023-11: wszystko wczesniej = smiec
constexpr int    VALID_YEAR_MIN  = 2024;
constexpr int    VALID_YEAR_MAX  = 2099;         // PCF85063A: rok dwucyfrowy 2000..2099

static bool isSupportedEpoch(time_t epoch) {
  if (epoch < MIN_VALID_EPOCH) return false;
  struct tm gm;
  gmtime_r(&epoch, &gm);
  int year = gm.tm_year + 1900;
  return year >= VALID_YEAR_MIN && year <= VALID_YEAR_MAX;
}

static bool getLocalTm(struct tm *out) {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return false;
  localtime_r(&now, out);
  return true;
}

static void setSystemEpoch(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
}

// Kotwiczenie czasu odczytanego z RTC: odczyt ma rozdzielczosc 1 s i nieznana
// faze (0..1 s po przewrocie), wiec wpis w POLOWIE sekundy minimalizuje
// oczekiwany |blad| fazy zegara systemowego (0.25 s zamiast 0.5 s).
static void setSystemEpochMidSecond(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 500000 };
  settimeofday(&tv, nullptr);
}

// Epoch dla godziny sciennej h:mi:s wzgledem doby 'base' (+addDays dni).
// mktime z tm_isdst=-1 -> poprawne przez noc zmiany czasu (doba != 86400 s).
static time_t epochForClock(struct tm base, int h, int mi, int s, int addDays) {
  base.tm_hour = h; base.tm_min = mi; base.tm_sec = s;
  base.tm_mday += addDays;     // mktime normalizuje przepelnienie
  base.tm_isdst = -1;          // mktime sam ustali DST
  return mktime(&base);
}

// Najblizsze PRZYSZLE wystapienie godziny sciennej h:mi:s (dzis lub jutro).
// Wspolny wzorzec dla budzikow i konca trybu nocnego.
static time_t nextOccurrence(const struct tm &base, int h, int mi, int s, time_t now) {
  time_t cand = epochForClock(base, h, mi, s, 0);
  if (cand <= now) cand = epochForClock(base, h, mi, s, 1);
  return cand;
}

// Czy budzik h:mi:s jest wymagalny TERAZ (termin <= now <= termin+lateWindowSec)?
// occurrenceDay dostaje klucz doby WYSTAPIENIA (nie doby biezacej) — dedup poprawny
// takze tuz po polnocy, gdy dzwoni budzik sprzed polnocy. dueEpoch (opcjonalny)
// dostaje dokladna chwile terminu — do wykrywania PRAWDZIWYCH kolizji budzikow.
static bool alarmDueNow(const struct tm &nowTm, time_t now, uint8_t h, uint8_t mi,
                        uint8_t s, uint32_t lateWindowSec, int *occurrenceDay,
                        time_t *dueEpoch) {
  time_t alarmAt = epochForClock(nowTm, h, mi, s, 0);
  if (alarmAt > now) alarmAt = epochForClock(nowTm, h, mi, s, -1);
  time_t delaySec = now - alarmAt;
  if (delaySec < 0 || (uint64_t)delaySec > lateWindowSec) return false;
  if (occurrenceDay) {
    struct tm alarmTm;
    localtime_r(&alarmAt, &alarmTm);
    *occurrenceDay = localDayKey(alarmTm);
  }
  if (dueEpoch) *dueEpoch = alarmAt;
  return true;
}

static uint8_t bcd2dec(uint8_t v) { return (v >> 4) * 10 + (v & 0x0F); }
static uint8_t dec2bcd(uint8_t v) { return (uint8_t)(((v / 10) << 4) | (v % 10)); }
static bool    validBcd(uint8_t v) { return (v & 0x0F) <= 9 && ((v >> 4) & 0x0F) <= 9; }
static bool    leapYear(int y) { return (y % 4 == 0 && y % 100 != 0) || (y % 400 == 0); }

static uint8_t daysInMonth(int y, int m) {
  static const uint8_t md[] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
  if (m == 2 && leapYear(y)) return 29;
  return md[m - 1];
}

static bool validDateTime(int y, int mo, int d, int h, int mi, int s) {
  if (y < VALID_YEAR_MIN || y > VALID_YEAR_MAX || mo < 1 || mo > 12) return false;
  if (d < 1 || d > daysInMonth(y, mo)) return false;
  return h >= 0 && h <= 23 && mi >= 0 && mi <= 59 && s >= 0 && s <= 59;
}

// --- Dekodowanie/kodowanie rejestru Offset (0x02) -----------------------------
static int8_t decodeRtcOffset(uint8_t raw) {
  int8_t v = (int8_t)(raw & 0x7F);
  if (v & 0x40) v -= 0x80;            // sign-extend (7-bit U2)
  return v;
}
static uint8_t encodeRtcOffset(int lsb, bool mode1) {
  if (lsb > 63)  lsb = 63;
  if (lsb < -64) lsb = -64;
  uint8_t reg = (uint8_t)(lsb & 0x7F);
  if (mode1) reg |= 0x80;
  return reg;
}
static float rtcOffsetPpm(int8_t lsb, bool mode1) {
  return (float)lsb * (mode1 ? rtccfg::OFFSET_LSB_PPM_MODE1 : rtccfg::OFFSET_LSB_PPM_MODE0);
}
// Sugerowana DOCELOWA wartosc offsetu po zmierzeniu dryfu (autotrim oraz /info).
static int suggestedTotalOffsetLsb(float driftSecPerDay, int currentLsb) {
  float lsbF  = (driftSecPerDay / rtccfg::PPM_SEC_PER_DAY) / rtccfg::OFFSET_LSB_PPM_MODE0;
  int   delta = (int)(lsbF + (lsbF >= 0 ? 0.5f : -0.5f));
  int   total = currentLsb + delta;
  if (total > 63)  total = 63;
  if (total < -64) total = -64;
  return total;
}

static const char *resetReasonText(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "zasilanie (zimny start)";
    case ESP_RST_EXT:       return "zewnetrzny pin RST";
    case ESP_RST_SW:        return "software (esp_restart)";
    case ESP_RST_PANIC:     return "panic / wyjatek";
    case ESP_RST_INT_WDT:   return "watchdog przerwan";
    case ESP_RST_TASK_WDT:  return "watchdog zadania (TWDT)";
    case ESP_RST_WDT:       return "inny watchdog";
    case ESP_RST_DEEPSLEEP: return "deep-sleep (planowe)";
    case ESP_RST_BROWNOUT:  return "brownout (spadek napiecia)";
    case ESP_RST_SDIO:      return "SDIO";
    default:                return "nieznany";
  }
}

// ============================================================================
//  [6] ESTYMATOR ZUZYCIA BATERII — czysta arytmetyka na probkach SoC.
//  Struktura z metodami zamiast wolnych funkcji: brak potrzeby forward-deklaracji
//  pod auto-prototypy Arduino, a stan i operacje mieszkaja razem.
//  POD bez konstruktorow/inicjalizatorow — zyje w RTC_DATA_ATTR (PersistentState).
// ============================================================================
struct DrainEstimator {
  bool     valid;
  int64_t  anchorEpoch;
  uint8_t  anchorSoc;
  int64_t  lastEpoch;
  uint8_t  lastSoc;

  void reset(int64_t epoch, uint8_t soc) {
    valid = true;
    anchorEpoch = epoch; anchorSoc = soc;
    lastEpoch   = epoch; lastSoc   = soc;
  }

  void onSample(int64_t epoch, uint8_t soc) {
    if (!valid) { reset(epoch, soc); return; }
    if (soc > anchorSoc + batcfg::DRAIN_CHARGE_HYST || soc > lastSoc + batcfg::DRAIN_CHARGE_HYST) {
      reset(epoch, soc); return;   // wykryto ladowanie -> restart okna
    }
    lastEpoch = epoch; lastSoc = soc;
  }

