Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  bool anyEnabled() const;
  NextAlarmInfo nextAlarm() const;
  void checkAlarms(uint32_t lateWindowSec = alarmcfg::LATE_WINDOW_SEC);

  // Uzywane przez PowerPlanner przy planowaniu snu.
  bool   anyDueNow(const struct tm &t) const;
  time_t nextEpoch(const struct tm &base, time_t now) const;

private:
  App &app_;
  std::array<AlarmConfig, alarmcfg::ALARM_COUNT> alarms_;
  int  pendingAlarm_ = -1;   // budzik wymagalny podczas dzwonienia innego (fix v8.0)

  void queueWhileRinging(const struct tm &t, time_t now, uint32_t lateWindowSec);
  bool firePendingIfAny();
  // rawSize() zasila kontrakt NVS — std::array nie moze dolozyc paddingu.
  static_assert(sizeof(std::array<AlarmConfig, alarmcfg::ALARM_COUNT>) ==
                alarmcfg::ALARM_COUNT * sizeof(AlarmConfig), "NVS blob 'alarms'");
};

// ============================================================================
//  [18] NetworkTimeService — WiFi + NTP: nieblokujaca maszyna stanow (NtpState)
//  + harmonogram dobowy. Czas z RTC pierwszy; NTP NADPISUJE tylko po REALNYM
//  pakiecie (gate atomic).
// ============================================================================
class NetworkTimeService {
public:
  explicit NetworkTimeService(App &app) : app_(app) {}

  void syncNow(SyncTrigger trigger);
  bool service();                       // true gdy NTP wlasnie zatwierdzil nowy czas
  void checkSchedule();                 // dobowa synchronizacja 18:00 (+ dogonienie)
  void handleRtcWriteRetry();
  void stopWifiAndNtp();
  bool ensureWifi(uint32_t timeoutMs);  // blokujace laczenie (tylko panel WWW)

  void setRetries(uint8_t n)   { retriesLeft_ = n; }
  bool isBusy() const          { return state_ != NtpState::Idle; }
  bool rtcWritePending() const { return rtcWriteRetriesLeft_ != 0; }
  long secsSinceLastSync() const;

  const char *ssid() const { return ssid_; }
  const char *pass() const { return pass_; }   // tylko do zapisu NVS (NIE renderowane w HTML)
  void setCreds(const char *s, const char *p);
  void setSsid(const String &s);
  void setPass(const String &p);

private:
  App           &app_;
  NtpState       state_          = NtpState::Idle;
  bool           manualAttempt_  = false;
  bool           wifiHintActive_ = false;
  uint32_t       stateStartedMs_ = 0;
  struct timeval fallbackTime_   = {};   // snapshot czasu przed proba (rollback po bledzie)
  uint8_t        retriesLeft_ = 0;
  uint32_t       nextRetryMs_ = 0;
  uint32_t       backoffMs_   = ntpcfg::BACKOFF_MIN_MS;
  uint32_t       wifiLostMs_  = 0;       // od kiedy WiFi zerwane w trakcie WaitingForPacket
  uint8_t        rtcWriteRetriesLeft_ = 0;
  uint32_t       rtcWriteNextRetryMs_ = 0;
  char           ssid_[33] = "";
  char           pass_[65] = "";

  static void wifiPowerOff() { WiFi.disconnect(false, false); WiFi.mode(WIFI_OFF); }
  static void copyBounded(char *dst, size_t dstSize, const char *src);
  bool wifiBeginSmart();
  void wifiRetryFullScan();
  void wifiCacheHint();
  void stopSntpCallbacks();
  void restoreTimeAfterFailedNtp();
  void beginNtpRequest();
  void failNtpAttempt(const char *status);   // wspolna sciezka porazki w WaitingForPacket
  void finishNtpAttempt(bool ok);
  bool handleNtpRetry();
  void scheduleRtcWriteRetry(uint8_t retries = rtccfg::WRITE_RETRIES);
#if ENABLE_RTC_AUTOTRIM
  void maybeAutotrimRtc(time_t syncedEpoch);
#endif
};

// ============================================================================
//  [19] DisplayUi — strony ekranu (U8g2) + dedup repaintu przez sygnature widoku.
//  ClockView to zdjecie WIDOCZNEJ tresci strony zegara: render i anty-mruganie
//  pracuja na tych samych danych, liczonych raz na obieg.
// ============================================================================
struct ClockView {
  uint8_t  hour, minute;
  int      dayKey;
  uint8_t  batteryPercent;
  bool     webActive;
  bool     anyAlarmEnabled;
  bool     hasNextAlarm;
  uint8_t  nextAlarmHour, nextAlarmMinute;

  // FNV-1a po widocznej tresci. Pola niepokazywane (ntpStatus/statusText) NIE
  // wchodza -> zero pelnych sendBuffer() identycznej klatki (zero mrugniec
  // panelu refleksyjnego).
  uint32_t signature() const {
    constexpr uint32_t FNV_OFFSET_BASIS = 2166136261u;
    constexpr uint32_t FNV_PRIME        = 16777619u;
    uint32_t h = FNV_OFFSET_BASIS;
    auto mix = [&](uint32_t v) { h = (h ^ v) * FNV_PRIME; };
    mix(hour);
    mix(minute);
    mix((uint32_t)dayKey);
    mix(batteryPercent);
    mix(webActive ? 1u : 0u);
    mix(anyAlarmEnabled ? 1u : 0u);
    mix(hasNextAlarm ? (uint32_t)(nextAlarmHour * 60 + nextAlarmMinute + 1) : 0u);
    return h;
  }
};

class DisplayUi {
public:
  DisplayUi(App &app, RlcdDisplay &panel) : app_(app), panel_(panel) {}

  void setup();                     // pelny re-init panelu (zimny start i po deep-sleep)
  void update();                    // dispatcher stron wg UiPage
  void drawNightPage();             // wolane przez PowerPlanner przed deep-sleep
#if ENABLE_LOW_BATTERY_PROTECT
  void drawCriticalBatteryPage();   // jw. przed ochronnym snem
#endif

private:
  App         &app_;
  RlcdDisplay &panel_;
  uint32_t     lastClockSig_ = FORCE_REPAINT_SIG;

  static constexpr uint32_t FORCE_REPAINT_SIG = 0xFFFFFFFFu;  // sentinel = wymus repaint

  // --- uklad strony zegara (wspolrzedne w px; panel 400x300 landscape) ---
  static constexpr int BATTERY_ICON_X   = 360;
  static constexpr int BATTERY_ICON_Y   = 8;
  static constexpr int FOOTER_LINE_Y    = 264;
  static constexpr int FOOTER_TEXT_Y    = 287;
  static constexpr int FOOTER_TEXT_X    = 42;
  static constexpr int FOOTER_BELL_X    = 10;
  static constexpr int FOOTER_BELL_Y    = 270;

  UiPage    resolvePage() const;
  ClockView makeClockView(const struct tm &t, int dayKey) const;
  void      renderTimePages();      // NoTime / Clock (wspolne dla update i wygasniecia podgladu)
  void      drawPhotoGlyph(int x, int y, int glyph, bool colon);
  void      drawLargeTime(uint8_t hour, uint8_t minute, int y);
  void      drawBellIcon(int x, int y, bool active);
  void      drawBatteryIcon(int x, int y, uint8_t percent);
  void      drawCentered(const char *text, int y);
  void      drawClockPage(const ClockView &view);
  void      drawPreviewPage();
  void      drawRingingPage();
  void      drawNoTimePage();
};

// ============================================================================
//  [20] WebPanel — panel konfiguracji, sync, pliki MP3, /info (WiFi na zadanie)
// ============================================================================
class WebPanel {
public:
  WebPanel(App &app, WebServer &server) : app_(app), server_(server) {}

  bool startWebWindow();
  void service();              // obsluga w loop(): grace WiFi + handleClient + timeout
  bool isActive() const { return active_; }
  void forceStop();            // server.stop + active_=false (przy zasypianiu nocnym)

