Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
private:
  App       &app_;
  WebServer &server_;
  bool       active_          = false;
  bool       routesInstalled_ = false;
  uint32_t   untilMs_         = 0;
  uint32_t   wifiLostMs_      = 0;

  File     mp3UploadFile_;
  bool     mp3UploadAccepted_ = false;
  bool     mp3UploadHadData_  = false;
  String   mp3UploadPath_     = "";
  String   mp3UploadTempPath_ = "";

  void stopWindow();
  void installRoutes();
  void redirectHome();        // 303 -> "/" (wspolne zakonczenie akcji POST/GET)
  void extendWindow()  { untilMs_ = millis() + webcfg::WINDOW_MS; }
  void appendMp3Manager(String &html);
  void pageHeader(String &h);
  void handleRoot();
  void handleSave();
  void handleSync();
  void handleStop();
  void handleTest();
  void handleMp3UploadDone();
  void handleMp3UploadStream();
  void discardUploadTemp();   // sprzatanie .part po pustym/przerwanym uploadzie
  void handleMp3Delete();
  void handleWebOff();
#if ENABLE_DIAGNOSTICS
  void handleInfo();
#endif
};

// ============================================================================
//  [21] PowerPlanner — tryb nocny (deep-sleep), light-sleep dzienny, ochronny sen
// ============================================================================
class PowerPlanner {
public:
  explicit PowerPlanner(App &app) : app_(app) {}

  void releaseNightHolds();
  void enterNightSleepIfNeeded(bool force);
  void idlePowerSave();
#if ENABLE_LOW_BATTERY_PROTECT
  void enterCriticalBatterySleepIfNeeded();
#endif

private:
  App &app_;
  void     holdNightPins();
  void     shutdownNightPeripherals();
  // Wspolne zejscie do deep-sleep (noc + ochrona ogniwa): peryferia off, CPU w dol,
  // timer + EXT1 z pull-upami, hold pinow, flush. NIE WRACA.
  [[noreturn]] void beginDeepSleep(uint64_t sleepUs, uint64_t ext1Mask);
  time_t   nightEndEpoch(time_t now);
  uint64_t computeIdleSleepUs();
};

// ============================================================================
//  [22] ButtonInput — polityka przyciskow (co znaczy krotkie/dlugie nacisniecie)
//  + stan podgladu budzika i okna utrzymania wybudzenia.
// ============================================================================
class ButtonInput {
public:
  explicit ButtonInput(App &app)
    : app_(app), keyButton_(pins::KEY), previewButton_(pins::PREVIEW) {}

  void begin();
  void pollKey();
  void pollPreview();
  void showPreview();
  void primeKeyFromSetup();           // KEY z deep-sleep: zacznij mierzyc nacisniecie (bez wakeHold)
  void primeKeyFromLightSleepWake();  // wybudzenie z light-sleep: jw. + utrzymaj wybudzenie
  void onPreviewWakeFromLightSleep(); // wybudzenie z light-sleep przyciskiem PREVIEW

  void holdWake()           { wakeHoldUntilMs_ = millis() + btncfg::WAKE_HOLD_MS; }
  bool wakeHeld() const     { return (int32_t)(millis() - wakeHoldUntilMs_) < 0; }
  bool previewActive() const       { return previewActive_; }
  bool previewWithinWindow() const { return (int32_t)(millis() - previewUntilMs_) < 0; }
  void clearPreview()              { previewActive_ = false; }

private:
  App            &app_;
  DebouncedButton keyButton_;
  DebouncedButton previewButton_;
  bool            previewActive_  = false;
  uint32_t        previewUntilMs_ = 0;
  uint32_t        wakeHoldUntilMs_ = 0;
};

// ============================================================================
//  [23] SettingsStore — NVS (budziki + WiFi + offset RTC + liczniki resetow).
//  JEDYNA klasa dotykajaca Preferences: pelna kontrola nad kluczami i zgodnoscia.
// ============================================================================
// Straznik RAII sesji Preferences: kazde wyjscie z funkcji (takze wczesny return)
// domyka NVS. Zero heapu, zero wyjatkow.
class NvsSession {
public:
  explicit NvsSession(Preferences &prefs)
    : prefs_(prefs), open_(prefs.begin(nvskeys::NAMESPACE_NAME, false)) {}
  ~NvsSession() { if (open_) prefs_.end(); }
  explicit operator bool() const { return open_; }
  NvsSession(const NvsSession &) = delete;
  NvsSession &operator=(const NvsSession &) = delete;

private:
  Preferences &prefs_;
  bool         open_;
};

class SettingsStore {
public:
  SettingsStore(App &app, Preferences &prefs) : app_(app), prefs_(prefs) {}

  void load();
  void save();
  void saveDrainSummary(uint8_t soc, float mahPerDay, int day);
#if ENABLE_RTC_AUTOTRIM
  void saveRtcOffset(int8_t lsb);   // tylko klucz "rtcOffLsb" (bez przepisywania reszty)
#endif
#if ENABLE_DIAGNOSTICS
  void     recordResetReason(esp_reset_reason_t r);
  uint32_t brownoutResets() const { return brownoutResets_; }
  uint32_t wdtResets() const      { return wdtResets_; }
  uint32_t panicResets() const    { return panicResets_; }
#endif

private:
  App         &app_;
  Preferences &prefs_;
#if ENABLE_DIAGNOSTICS
  uint32_t brownoutResets_ = 0;
  uint32_t wdtResets_      = 0;
  uint32_t panicResets_    = 0;
#endif
};

// ============================================================================
//  [24] App — koordynator (mediator). Trzyma wszystkie moduly i stan UI; sprzet
//  dostaje w konstruktorze i rozdaje modulom przez referencje (lekki DI: kazdy
//  modul widzi tylko to, czym steruje, a rodzenstwo osiaga przez App&).
// ============================================================================
class App {
public:
  App(TwoWire &i2c, RlcdDisplay &panel, WebServer &server, Preferences &prefs, Audio &decoder)
    : rtc_(i2c), codec_(i2c),
      battery_(*this), audio_(*this, decoder, codec_), alarms_(*this),
      ntp_(*this), display_(*this, panel), web_(*this, server), power_(*this),
      buttons_(*this), settings_(*this, prefs) {}

  void setup();
  void loop();

  // --- mediator: dostep do rodzenstwa ---
  SoundStore         &soundStore() { return soundStore_; }
  RtcController      &rtc()        { return rtc_; }
  BatteryMonitor     &battery()    { return battery_; }
  AudioPlayer        &audio()      { return audio_; }
  AlarmScheduler     &alarms()     { return alarms_; }
  NetworkTimeService &ntp()        { return ntp_; }
  DisplayUi          &displayUi()  { return display_; }
  WebPanel           &web()        { return web_; }
  PowerPlanner       &power()      { return power_; }
  ButtonInput        &buttons()    { return buttons_; }
  SettingsStore      &settings()   { return settings_; }
  PersistentState    &persist()    { return g_persist; }

  // --- stan UI (flaga repaintu + teksty statusow) ---
  void markDirty()                   { dirty_ = true; }
  void clearDirty()                  { dirty_ = false; }
  bool dirty() const                 { return dirty_; }
  void setStatus(const String &s)    { statusText_ = s; }
  const String &statusText() const   { return statusText_; }
  void setNtpStatus(const String &s) { ntpStatus_ = s; }
  const String &ntpStatus() const    { return ntpStatus_; }

  // --- bramki wspoldzielone ---
  bool audioActive() const { return audio_.isPlaying() || audio_.isRinging(); }
  // Stan, w ktorym NIE wolno uspic na dlugo (jedna definicja dla wszystkich snow).
  bool busy() const {
    return audioActive() || web_.isActive() || buttons_.previewActive() ||
           ntp_.isBusy() || ntp_.rtcWritePending();
  }

