Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
private:
  SoundStore         soundStore_;
  RtcController      rtc_;
  Es8311Codec        codec_;
  BatteryMonitor     battery_;
  AudioPlayer        audio_;
  AlarmScheduler     alarms_;
  NetworkTimeService ntp_;
  DisplayUi          display_;
  WebPanel           web_;
  PowerPlanner       power_;
  ButtonInput        buttons_;
  SettingsStore      settings_;

  bool     dirty_      = true;
  String   statusText_ = "IDLE";
  String   ntpStatus_  = "never";
  uint32_t lastAlarmCheckMs_ = 0;   // loop(): poszerza okno spoznienia o przestoj petli
};

// Jedyna instancja koordynatora — tu widac cale okablowanie sprzetu.
static App app(Wire, display, httpServer, preferences, audioOutput);

// ============================================================================
//  IMPLEMENTACJE — RtcController (PCF85063A)
// ============================================================================
// Odblokowanie zawieszonej szyny I2C: slave (RTC/kodek) trzymajacy SDA nisko po
// resecie ESP w polowie transakcji zwalnia ja po maks. 9 impulsach SCL + STOP.
// Bez tego kazda sesja RTC pada az do odlaczenia zasilania. Zwraca true, gdy
// szyna byla zawieszona i zostala uwolniona.
bool RtcController::recoverStuckBus() {
  // Sonda BEZ pinMode: rekonfiguracja pinu I2C w core 3.x przechodzi przez
  // Peripheral Manager i deinicjalizuje caly sterownik Wire (wspoldzielony z
  // ES8311) — nawet przy zwyklym NACK. gpio_get_level czyta stan szyny nie
  // dotykajac konfiguracji (bufor wejsciowy SDA wlaczony przez sterownik I2C).
  if (gpio_get_level(pins::I2C_SDA) == 1) return false;   // SDA wolne -> zwykly NACK
  wire_.end();                                            // jawny demontaz PRZED przejeciem pinow
  pinMode(pins::I2C_SDA, INPUT_PULLUP);
  pinMode(pins::I2C_SCL, OUTPUT_OPEN_DRAIN);
  digitalWrite(pins::I2C_SCL, HIGH);
  for (uint8_t i = 0; i < i2cbus::RECOVER_MAX_PULSES && digitalRead(pins::I2C_SDA) == LOW; i++) {
    digitalWrite(pins::I2C_SCL, LOW);  delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
    digitalWrite(pins::I2C_SCL, HIGH); delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  }
  pinMode(pins::I2C_SDA, OUTPUT_OPEN_DRAIN);              // warunek STOP: SDA lo->hi przy SCL hi
  digitalWrite(pins::I2C_SDA, LOW);  delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  digitalWrite(pins::I2C_SDA, HIGH); delayMicroseconds(i2cbus::RECOVER_HALF_PERIOD_US);
  bool freed = digitalRead(pins::I2C_SDA) == HIGH;
  Serial.printf("I2C: szyna zawieszona -> odzysk %s\n", freed ? "OK" : "NIEUDANY");
  return freed;
}

bool RtcController::beginSession() {
  wire_.begin(pins::I2C_SDA, pins::I2C_SCL);
  wire_.setClock(i2cbus::FREQ_HZ);
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  if (wire_.endTransmission() == 0) return true;
  if (!recoverStuckBus()) return false;                   // NACK bez zwisu SDA -> zwykly blad
  wire_.begin(pins::I2C_SDA, pins::I2C_SCL);              // po odzysku pelna re-inicjalizacja
  wire_.setClock(i2cbus::FREQ_HZ);
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  return wire_.endTransmission() == 0;
}

bool RtcController::writeReg(uint8_t reg, uint8_t value) {
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(reg);
  wire_.write(value);
  return wire_.endTransmission() == 0;
}

// Odczyt n rejestrow od 'reg' jednym transferem. Wolajacy juz otworzyl sesje.
bool RtcController::readRegs(uint8_t reg, uint8_t *buf, uint8_t n) {
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(reg);
  if (wire_.endTransmission(false) != 0) return false;
  if (wire_.requestFrom((uint8_t)pcf85063::I2C_ADDR, n) != n) return false;
  for (uint8_t i = 0; i < n; i++) buf[i] = wire_.read();
  return true;
}

bool RtcController::readControl1(uint8_t *control1) {
  if (!control1 || !beginSession()) return false;
  return readRegs(pcf85063::REG_CONTROL1, control1, 1);
}
bool RtcController::readControl2(uint8_t *control2) {
  if (!control2 || !beginSession()) return false;
  return readRegs(pcf85063::REG_CONTROL2, control2, 1);
}
bool RtcController::writeControl1(uint8_t control1) {
  return writeReg(pcf85063::REG_CONTROL1, control1);
}

bool RtcController::releaseClock(uint8_t runningControl1) {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    if (writeControl1(runningControl1)) return true;
    delay(2);
  }
  return false;
}

// Zatrzymaj licznik przed ustawieniem czasu. STOP zeruje glowna czesc preskalera
// -> pierwszy impuls sekundowy ma okreslona faze.
bool RtcController::prepareTimeWrite(uint8_t *runningControl1) {
  if (!runningControl1) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  *runningControl1 = control1 & (uint8_t)~pcf85063::CTRL1_RUN_CLEAR_MASK;
  if (writeControl1(*runningControl1 | pcf85063::CTRL1_STOP)) return true;
  releaseClock(*runningControl1);
  return false;
}

// Marker w bajcie RAM RTC: "czas zapisal ten firmware w znanym formacie".
// Brak markera = RTC ustawiony przez cos innego / niepelny zapis -> nie ufamy.
bool RtcController::hasCurrentFormat() {
  uint8_t marker;
  return readRegs(pcf85063::REG_RAM_BYTE, &marker, 1) && marker == pcf85063::FORMAT_MARKER;
}
bool RtcController::storeCurrentFormat()      { return writeReg(pcf85063::REG_RAM_BYTE, pcf85063::FORMAT_MARKER); }
bool RtcController::invalidateCurrentFormat() { return writeReg(pcf85063::REG_RAM_BYTE, 0); }

// Odczyt 7 rejestrow czasu (0x04..0x0A) jednym transferem -> brak rwania na granicy
// sekundy. Rok 00..99 = 2000..2099.
bool RtcController::readEpochInternal(time_t *epoch, bool requireCurrentFormat) {
  if (!epoch) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;

  // Nie wznawiaj po cichu zatrzymanego/przestawionego RTC (staly czas != aktualny).
  if ((control1 & pcf85063::CTRL1_INVALID_MODE_MASK) != 0 ||
      (requireCurrentFormat && !hasCurrentFormat())) return false;

  uint8_t t[7];
  if (!readRegs(pcf85063::REG_SECONDS, t, 7)) return false;
  uint8_t secReg = t[0], minReg = t[1], hourReg = t[2], dayReg = t[3];
  uint8_t monReg = t[5], yearReg = t[6];   // t[4] = dzien tygodnia (pomijamy)

  bool oscStopped = (secReg & pcf85063::SECONDS_OS) != 0;
  secReg &= 0x7F; minReg &= 0x7F; hourReg &= 0x3F; dayReg &= 0x3F; monReg &= 0x1F;

