Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  if (oscStopped || !validBcd(secReg) || !validBcd(minReg) || !validBcd(hourReg) ||
      !validBcd(dayReg) || !validBcd(monReg) || !validBcd(yearReg)) return false;

  int s  = bcd2dec(secReg), mi = bcd2dec(minReg), h = bcd2dec(hourReg);
  int d  = bcd2dec(dayReg), mo = bcd2dec(monReg), y = bcd2dec(yearReg) + 2000;

  if (!validDateTime(y, mo, d, h, mi, s)) return false;
  *epoch = utcEpochFromCivil(y, mo, d, h, mi, s);
  return true;
}

bool RtcController::readEpoch(time_t *epoch) { return readEpochInternal(epoch, true); }

bool RtcController::readToSystem() {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    time_t epoch;
    if (readEpoch(&epoch)) { setSystemEpochMidSecond(epoch); return true; }
    delay(2);
  }
  return false;
}

// Zapis czasu UTC do RTC z WYROWNANIEM do granicy sekundy. Po zwolnieniu STOP
// preskaler startuje od zera, wiec wpisana sekunda "trzyma sie" ~1.0 s -> faza
// przewrotu = chwila zwolnienia STOP. Pomijamy wyrownanie gdy gra audio/budzik
// (audioActive) — busy-wait do ~1 s przerwalby audio.loop().
bool RtcController::writeTime(time_t epoch, bool audioActive) {
  if (!isSupportedEpoch(epoch)) return false;
#if ENABLE_RTC_AUTOTRIM
  g_persist.rtcPhaseAligned = false;   // az do potwierdzonego, wyrownanego zapisu
#endif

  struct timeval tv;
  gettimeofday(&tv, nullptr);
  time_t writeEpoch = epoch;
  bool   alignToBoundary = false;
  if (!audioActive &&
      isSupportedEpoch(tv.tv_sec) && (tv.tv_sec == epoch || tv.tv_sec + 1 == epoch)) {
    writeEpoch = tv.tv_sec + 1;          // najblizsza nadchodzaca pelna sekunda
    alignToBoundary = true;
  }

  struct tm gm;
  gmtime_r(&writeEpoch, &gm);
  int year = gm.tm_year + 1900;

  // Najpierw uniewaznij dane: reset w dowolnym dalszym miejscu nie ujawni
  // niepelnego zapisu jako poprawnego czasu.
  if (!beginSession()) return false;
  if (!invalidateCurrentFormat()) return false;
  uint8_t runningControl1;
  if (!prepareTimeWrite(&runningControl1)) return false;
  uint8_t yearReg = (uint8_t)(year % 100);

  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(pcf85063::REG_SECONDS);
  wire_.write(dec2bcd(gm.tm_sec) & 0x7F);            // OS=0 -> oscylator OK
  wire_.write(dec2bcd(gm.tm_min) & 0x7F);
  wire_.write(dec2bcd(gm.tm_hour) & 0x3F);
  wire_.write(dec2bcd(gm.tm_mday) & 0x3F);
  wire_.write((uint8_t)(gm.tm_wday & 0x07));
  wire_.write(dec2bcd((uint8_t)(gm.tm_mon + 1)) & 0x1F);
  wire_.write(dec2bcd(yearReg));
  if (wire_.endTransmission() != 0) { releaseClock(runningControl1); return false; }

  // Odczekaj do granicy docelowej sekundy (czas I2C wliczony), potem zwolnij STOP.
  if (alignToBoundary) {
    struct timeval nowTv;
    for (;;) {
      gettimeofday(&nowTv, nullptr);
      int64_t remainingUs = ((int64_t)writeEpoch - nowTv.tv_sec) * 1000000LL - nowTv.tv_usec;
      if (remainingUs <= 0) break;
      // Startowalismy z <=1 s zapasu; wiecej oznacza, ze rownolegly settimeofday
      // (np. pakiet SNTP w tasku lwIP) skoczyl czasem — kotwica stracila sens.
      // Przerwij CALY zapis: marker formatu juz uniewazniony, retry ponowi zapis
      // swiezym czasem (fix v8.0: wczesniej petla mogla wisiec do resetu TWDT).
      if (remainingUs > rtccfg::ALIGN_ABORT_US) { releaseClock(runningControl1); return false; }
      watchdogFeed();
      if (remainingUs > 2000) delay(1); else delayMicroseconds((uint32_t)remainingUs);
    }
  }
  if (!releaseClock(runningControl1)) return false;

  time_t verifiedEpoch;
  if (!readEpochInternal(&verifiedEpoch, false)) return false;
  long long diff = (long long)verifiedEpoch - (long long)writeEpoch;
  if (diff < -rtccfg::WRITE_VERIFY_TOLERANCE_SEC || diff > rtccfg::WRITE_VERIFY_TOLERANCE_SEC) return false;
  if (storeCurrentFormat() && hasCurrentFormat()) {
#if ENABLE_RTC_AUTOTRIM
    g_persist.rtcPhaseAligned = alignToBoundary;   // okno dryftu mierzalne fazowo
#endif
    return true;
  }
  invalidateCurrentFormat();
  return false;
}

// Kalibracja sprzetowa dryfu (rejestr 0x02) Z WERYFIKACJA odczytem zwrotnym.
// Wolana przy KAZDYM starcie: rejestr jest podtrzymywany bateryjnie, ale ponowny
// zapis+odczyt dowodzi, ze bajt wszedl. Cel zapisu = targetOffsetReg_ (start:
// FACTORY_OFFSET_REG; SettingsStore::load moze nadpisac wartoscia z NVS).
bool RtcController::ensureOffsetCalibration() {
  offsetVerified_ = false;
  for (uint8_t attempt = 0; attempt < rtccfg::OFFSET_WRITE_RETRIES; attempt++) {
    if (!beginSession()) { delay(2); continue; }
    writeReg(pcf85063::REG_OFFSET, targetOffsetReg_);
    uint8_t raw;
    if (readRegs(pcf85063::REG_OFFSET, &raw, 1)) {
      offsetRaw_ = raw;
      offsetLsb_ = decodeRtcOffset(raw);
      offsetPpm_ = rtcOffsetPpm(offsetLsb_, (raw & 0x80) != 0);
      if (raw == targetOffsetReg_) { offsetVerified_ = true; return true; }
    }
    delay(2);
  }
  return false;
}

#if ENABLE_RTC_AUTOTRIM
bool RtcController::applyOffsetLsb(int8_t lsb) {
  setTargetOffsetLsb(lsb);
  return ensureOffsetCalibration();
}

// Pomiar dryftu z rozdzielczoscia ~ms zamiast 1 s: czekaj (polling I2C) na
// przewrot sekundy RTC i zlap te chwile wg zegara systemowego. Wolane ZARAZ po
// pakiecie NTP (czas systemowy = wzorzec) i PRZED writeTime (nadpisze faze).
// W przewrocie faza RTC = dokladnie 0.000 s, wiec epokaRTC*1e6 - czas_sys_us
// = dryft narosly od ostatniego wyrownanego zapisu. Blokuje do ~1.3 s — wolac
// tylko bez aktywnego audio (busy-wait zaglodzilby audio.loop()).
bool RtcController::measureDriftUs(int64_t *driftUs) {
  if (!driftUs || !beginSession()) return false;
  uint8_t sec0, sec;
  if (!readRegs(pcf85063::REG_SECONDS, &sec0, 1)) return false;
  sec0 &= 0x7F;
  uint32_t startMs = millis();
  do {
    if (millis() - startMs > rtccfg::BOUNDARY_POLL_TIMEOUT_MS) return false;   // brak przewrotu: oscylator stoi
    if (!readRegs(pcf85063::REG_SECONDS, &sec, 1)) return false;
    sec &= 0x7F;
  } while (sec == sec0);
  struct timeval tv;
  gettimeofday(&tv, nullptr);              // chwila przewrotu wg czasu systemowego
  watchdogFeed();
  time_t rtcEpoch;
  if (!readEpochInternal(&rtcEpoch, true)) return false;
  *driftUs = (int64_t)rtcEpoch * 1000000LL -
             ((int64_t)tv.tv_sec * 1000000LL + (int64_t)tv.tv_usec);
  return true;
}
#endif

// INT sluzy wylacznie alarmowi wybudzajacemu. Wylacz korekcje (CIE), timer i
// CLKOUT (mniejszy pobor RTC); AIE tylko gdy alarm uzbrojony.
bool RtcController::configureWakeInterrupt(bool alarmEnabled) {
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  control1 &= (uint8_t)~pcf85063::CTRL1_CIE;
  if (!writeReg(pcf85063::REG_CONTROL1, control1)) return false;
  if (!writeReg(pcf85063::REG_TIMER_MODE, pcf85063::TIMER_MODE_OFF)) return false;
  if (!writeReg(pcf85063::REG_TIMER_VALUE, 0)) return false;
  uint8_t control2;
  if (!readControl2(&control2)) return false;
  // Zapis control2 kasuje przy okazji flagi AF/TF (pola flagowe piszemy zerem).
  control2 = (uint8_t)(pcf85063::CTRL2_COF_OFF | (alarmEnabled ? pcf85063::CTRL2_AIE : 0));
  return writeReg(pcf85063::REG_CONTROL2, control2);
}

bool RtcController::verifyWakeInterruptConfig(bool alarmEnabled) {
  uint8_t control1, control2;
  if (!readControl1(&control1) || !readControl2(&control2)) return false;
  if (!beginSession()) return false;
  uint8_t timer[2];
  if (!readRegs(pcf85063::REG_TIMER_VALUE, timer, 2)) return false;
  uint8_t expectedControl2 = alarmEnabled ? pcf85063::CTRL2_AIE : 0;
  return (control1 & pcf85063::CTRL1_CIE) == 0 &&
         (control2 & 0xF8) == expectedControl2 &&
         timer[0] == 0 && timer[1] == pcf85063::TIMER_MODE_OFF;
}

bool RtcController::verifyWakeAlarm(time_t epoch) {
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  uint8_t a[5];
  if (!readRegs(pcf85063::REG_SECOND_ALARM, a, 5)) return false;
  if (a[0] != (dec2bcd((uint8_t)gm.tm_sec) & 0x7F) ||
      a[1] != (dec2bcd((uint8_t)gm.tm_min) & 0x7F) ||
      a[2] != (dec2bcd((uint8_t)gm.tm_hour) & 0x3F) ||
      a[3] != (dec2bcd((uint8_t)gm.tm_mday) & 0x3F) ||
      a[4] != pcf85063::ALARM_AEN_OFF) return false;
  return verifyWakeInterruptConfig(true);
}

// Alarm PCF85063A pracuje w UTC (jak rejestry czasu). INT aktywne stanem niskim.
// Odmowa gdy RTC i czas systemowy rozjechane > WAKE_MAX_SKEW_SEC — alarm liczony
// z czasu systemowego musi trafic w czas RTC.
bool RtcController::setWakeAlarm(time_t epoch) {
  time_t systemNow = time(nullptr);
  if (!isSupportedEpoch(epoch) || !isSupportedEpoch(systemNow)) return false;
  time_t rtcNow;
  if (!readEpoch(&rtcNow)) return false;     // odrzuca STOP/12h
  long long rtcSkew = (long long)rtcNow - (long long)systemNow;
  if (rtcSkew < -rtccfg::WAKE_MAX_SKEW_SEC || rtcSkew > rtccfg::WAKE_MAX_SKEW_SEC) return false;
  if (!configureWakeInterrupt(false)) return false;

