Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!beginSession()) return false;
  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(pcf85063::REG_SECOND_ALARM);
  wire_.write(dec2bcd((uint8_t)gm.tm_sec) & 0x7F); // AEN=0 -> pole aktywne
  wire_.write(dec2bcd((uint8_t)gm.tm_min) & 0x7F);
  wire_.write(dec2bcd((uint8_t)gm.tm_hour) & 0x3F);
  wire_.write(dec2bcd((uint8_t)gm.tm_mday) & 0x3F);
  wire_.write(pcf85063::ALARM_AEN_OFF);            // Weekday_alarm wylaczony
  if (wire_.endTransmission() != 0) return false;

  if (!configureWakeInterrupt(true)) return false;
  return verifyWakeAlarm(epoch);
}

bool RtcController::disableWakeAlarm() {
  return configureWakeInterrupt(false) && verifyWakeInterruptConfig(false);
}

// ============================================================================
//  IMPLEMENTACJE — SoundStore (system plikow MP3)
// ============================================================================
// Dokoncz przerwana instalacje MP3 (patrz WebPanel::handleMp3UploadStream):
// osierocony .bak wraca na miejsce (lub znika, gdy cel istnieje), osierocony
// .part jest sprzatany. Jedno przejscie = jedna naprawa; wolane w petli.
bool SoundStore::recoverSoundFilesOnce() {
  File root = fs_->open("/");
  if (!root) return false;
  for (File f = root.openNextFile(); f; f = root.openNextFile()) {
    bool isDir = f.isDirectory();
    String path = f.name();
    f.close();
    if (isDir) continue;
    if (!path.startsWith("/")) path = String("/") + path;
    String lower = path; lower.toLowerCase();
    if (lower.endsWith(".bak") && path.length() > 5) {
      String target = path.substring(0, path.length() - 4);
      bool changed = fs_->exists(target) ? fs_->remove(path) : fs_->rename(path, target);
      if (changed) { root.close(); return true; }
    } else if (lower.endsWith(".part") && path.length() > 6) {
      String target = path.substring(0, path.length() - 5);
      String backup = target + ".bak";
      if (fs_->exists(backup) && !fs_->exists(target)) continue;
      if (fs_->remove(path)) { root.close(); return true; }
    }
  }
  root.close();
  return false;
}

void SoundStore::recoverSoundFiles() {
  if (!fs_) return;
  for (uint8_t pass = 0; pass < fscfg::RECOVER_MAX_PASSES && recoverSoundFilesOnce(); pass++) {}
}

bool SoundStore::ensureMounted() {
  if (backend_ != FsBackend::None && fs_) return true;

  // Probuj po kolei znane systemy plikow (bez formatowania).
  struct Candidate { fs::FS *fs; FsBackend backend; bool ok; };
  Candidate candidates[] = {
    { &SPIFFS,   FsBackend::Spiffs,   SPIFFS.begin(false) },
    { &LittleFS, FsBackend::LittleFs, false },
    { &FFat,     FsBackend::FFatFs,   false },
  };
  if (!candidates[0].ok) candidates[1].ok = LittleFS.begin(false);
  if (!candidates[0].ok && !candidates[1].ok) candidates[2].ok = FFat.begin(false);
  for (auto &c : candidates) {
    if (c.ok) {
      backend_ = c.backend; fs_ = c.fs;
      recoverSoundFiles();
      Serial.printf("System plikow: %s\n", name());
      return true;
    }
  }
  // Fabrycznie czysty flash: jednorazowy format SPIFFS, by panel WWW mogl wgrac MP3.
  if (!formatTried_) {
    formatTried_ = true;
    Serial.println("Brak FS - formatuje SPIFFS...");
    if (SPIFFS.begin(true)) {
      backend_ = FsBackend::Spiffs; fs_ = &SPIFFS;
      Serial.println("System plikow: SPIFFS (nowo sformatowany)");
      return true;
    }
  }
  backend_ = FsBackend::None; fs_ = nullptr;
  Serial.println("Brak systemu plikow z MP3");
  return false;
}

// ============================================================================
//  IMPLEMENTACJE — BatteryMonitor
// ============================================================================
bool BatteryMonitor::init() {
  if (ready_) return true;
  adc_oneshot_unit_init_cfg_t initCfg = {};
  initCfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&initCfg, &adc_) != ESP_OK) return false;

  adc_oneshot_chan_cfg_t chanCfg = {};
  chanCfg.bitwidth = ADC_BITWIDTH_12;
  chanCfg.atten = ADC_ATTEN_DB_12;
  if (adc_oneshot_config_channel(adc_, batcfg::ADC_CHANNEL, &chanCfg) != ESP_OK) {
    adc_oneshot_del_unit(adc_); adc_ = nullptr; return false;
  }
  adc_cali_curve_fitting_config_t caliCfg = {};
  caliCfg.unit_id = ADC_UNIT_1;
  caliCfg.atten = ADC_ATTEN_DB_12;
  caliCfg.bitwidth = ADC_BITWIDTH_12;
  caliReady_ = adc_cali_create_scheme_curve_fitting(&caliCfg, &cali_) == ESP_OK;
  ready_ = true;
  return true;
}

// Interpolacja liniowa po krzywej OCV->SoC (batcfg::OCV_CURVE).
uint8_t BatteryMonitor::percentFromVoltage(float v) {
  const auto &curve = batcfg::OCV_CURVE;
  if (v <= curve.front().voltage) return 0;
  if (v >= curve.back().voltage)  return 100;
  for (size_t i = 1; i < curve.size(); i++) {
    if (v < curve[i].voltage) {
      float frac = (v - curve[i-1].voltage) / (curve[i].voltage - curve[i-1].voltage);
      return (uint8_t)(curve[i-1].soc + frac * (curve[i].soc - curve[i-1].soc) + 0.5f);
    }
  }
  return 100;
}

// Histereza pelnego naladowania: >=99% pokazuj 100% i trzymaj, az spadnie <98%.
uint8_t BatteryMonitor::stabilizePercent(uint8_t measured) const {
  if (measured >= batcfg::FULL_FLOOR) return 100;
  if (g_persist.batteryHasReading && g_persist.batteryPercent == 100 &&
      measured >= batcfg::FULL_HOLD_FLOOR) return 100;
  return measured;
}

// Zwiezle podsumowanie zuzycia do NVS max raz/dobe (nadpisywane, malo flash).
void BatteryMonitor::maybeWriteDailySummary(time_t now) {
  struct tm t; localtime_r(&now, &t);
  int day = localDayKey(t);
  if (day == g_persist.lastSummaryDay) return;
  float perDay = g_persist.drain.mahPerDay();
  if (perDay < 0.0f) return;
  g_persist.lastSummaryDay = day;              // oznacz dzien NIM sprobujesz zapisu
  app_.settings().saveDrainSummary(g_persist.batteryPercent, perDay, day);
  Serial.printf("Zuzycie: %.1f mAh/dzien, ~%.0f dni\n",
                perDay, g_persist.drain.daysRemaining(g_persist.batteryPercent));
}

void BatteryMonitor::update(bool force) {
  if (!force && (int32_t)(millis() - nextReadMs_) < 0) return;

