Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  // Pod obciazeniem (audio, dzwoniacy budzik, serwer web) napiecie zacisku siada
  // przez rezystancje wewnetrzna ogniwa -> pomiar zanizony. Odlozyc do bezczynnosci.
  if (!force && (app_.audioActive() || app_.web().isActive())) {
    nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return;
  }

  nextReadMs_ = millis() + batcfg::READ_INTERVAL_MS;
  if (!init()) { nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return; }

  uint32_t sum = 0; uint8_t samples = 0;
  for (uint8_t i = 0; i < batcfg::SAMPLE_COUNT; i++) {
    int raw = 0;
    if (adc_oneshot_read(adc_, batcfg::ADC_CHANNEL, &raw) == ESP_OK) { sum += (uint32_t)raw; samples++; }
  }
  if (samples == 0) { nextReadMs_ = millis() + batcfg::BUSY_RETRY_MS; return; }

  int raw = (int)((sum + samples / 2) / samples);
  int mv = 0;
  if (caliReady_) adc_cali_raw_to_voltage(cali_, raw, &mv);
  else mv = (raw * batcfg::ADC_FALLBACK_FULL_MV) / batcfg::ADC_MAX_RAW;   // bez kalibracji eFuse

  float measured = (mv * 0.001f) * batcfg::DIVIDER_RATIO * batcfg::VOLTAGE_CALIBRATION;
  if (!g_persist.batteryHasReading || force) { g_persist.batteryVoltage = measured; g_persist.batteryHasReading = true; }
  else g_persist.batteryVoltage = g_persist.batteryVoltage * batcfg::EMA_KEEP +
                                  measured * (1.0f - batcfg::EMA_KEEP);   // EMA

  uint8_t old = g_persist.batteryPercent;
  g_persist.batteryPercent = stabilizePercent(percentFromVoltage(g_persist.batteryVoltage));
  time_t nowT = time(nullptr);
  if (isSupportedEpoch(nowT)) {
    g_persist.drain.onSample((int64_t)nowT, g_persist.batteryPercent);
    maybeWriteDailySummary(nowT);
#if ENABLE_DIAGNOSTICS
    if (g_persist.coldBootEpoch == 0) g_persist.coldBootEpoch = (int64_t)nowT;
#endif
  }
  if (force || old != g_persist.batteryPercent) app_.markDirty();
}

#if ENABLE_LOW_BATTERY_PROTECT
bool BatteryMonitor::isLow() const {
  return g_persist.batteryHasReading && g_persist.batteryPercent <= batcfg::LOW_PERCENT;
}
// update() bramkuje pomiar pod obciazeniem, wiec batteryVoltage ~ OCV.
bool BatteryMonitor::isCritical() const {
  return g_persist.batteryHasReading &&
         (g_persist.batteryVoltage <= batcfg::CRITICAL_VOLTAGE ||
          g_persist.batteryPercent <= batcfg::CRITICAL_PERCENT);
}
#endif

// ============================================================================
//  IMPLEMENTACJE — AudioPlayer (ES8311 + MP3 przez I2S, petla dzwonienia)
// ============================================================================
void AudioPlayer::ensurePins() {
  if (pinsReady_) return;
  Audio::audio_info_callback = audioLogCallback;
  decoder_.setPinout(pins::I2S_BCLK, pins::I2S_WS, pins::I2S_DOUT, pins::I2S_MCLK);
  decoder_.setOutput48KHz(true);
  decoder_.setVolume(alarmcfg::DEFAULT_VOLUME);
  pinsReady_ = true;
}

bool AudioPlayer::ensureCodec() {
  if (ready_) return true;
  setCpuFrequencyMhz(powercfg::AUDIO_CPU_MHZ);  // dekoder MP3 potrzebuje zapasu ponad dzienne 80 MHz
  amplifierOff();   // PA wlacza dopiero startSound() PO konfiguracji kodeka (bez trzasku)
  ensurePins();
  ready_ = codec_.begin(pins::I2C_SDA, pins::I2C_SCL, i2cbus::FREQ_HZ);
  if (ready_) { codec_.setVolume(alarmcfg::CODEC_VOLUME_PERCENT); codec_.configBits16(); }
  else {
    Serial.println("ES8311 init failed");
    digitalWrite(pins::PA_ENABLE, LOW);
    setCpuFrequencyMhz(powercfg::DAY_CPU_MHZ);  // audio nie ruszy -> nie trzymaj podbitego CPU
  }
  return ready_;
}

void AudioPlayer::codecPowerDown() { codec_.powerDown(); }

// Uspij kodek po odtwarzaniu — ES8311 jest na stalej szynie 3V3, wiec to najwiekszy
// odbiornik w spoczynku. startSound() go wskrzesza. Zdejmuje tez podbicie CPU
// (nocne sciezki i tak ustawiaja PRE_SLEEP_CPU_MHZ PO tym wywolaniu).
void AudioPlayer::shutdownCodec() {
  if (!ready_) { digitalWrite(pins::PA_ENABLE, LOW); return; }
  decoder_.stopSong();
  codec_.powerDown();
  digitalWrite(pins::PA_ENABLE, LOW);
  ready_ = false;
  setCpuFrequencyMhz(powercfg::DAY_CPU_MHZ);
}

bool AudioPlayer::startSound(uint8_t soundIndex, uint8_t volume) {
  stopPlayback(StopCause::Auto);
  if (soundIndex >= alarmcfg::SOUND_COUNT) soundIndex = 0;

  // Wspolne zakonczenie bledu: kodek spac, status na ekran, repaint.
  auto fail = [&](const String &status, bool codecUp) {
    if (codecUp) shutdownCodec();
    app_.setStatus(status);
    app_.markDirty();
    return false;
  };

  if (!app_.soundStore().ensureMounted() || !ensureCodec()) return fail("blad FS/kodek", false);
  const char *path = alarmcfg::SOUND_FILES[soundIndex];
  if (!app_.soundStore().fs()->exists(path)) return fail(String("brak ") + path, true);

  digitalWrite(pins::PA_ENABLE, HIGH);
  decoder_.stopSong();
  decoder_.setVolume(constrain(volume, 0, alarmcfg::MAX_VOLUME));
  codec_.setVolume(alarmcfg::CODEC_VOLUME_PERCENT);
  if (!decoder_.connecttoFS(*app_.soundStore().fs(), path))
    return fail(String("blad odtw. ") + path, true);

  soundStartedMs_ = millis();
  playing_ = true;
  Serial.printf("Odtwarzam %s vol=%u\n", path, volume);
  app_.markDirty();
  return true;
}

void AudioPlayer::stopPlayback(StopCause cause) {
  bool userStopped = (cause == StopCause::User);
  if (userStopped) { ringing_ = false; ringingAlarm_ = -1; ringErrors_ = 0; }
  if (ready_) {
    decoder_.stopSong();
    decoder_.setVolume(0);
    codec_.setVolume(0);
    digitalWrite(pins::PA_ENABLE, LOW);
  }
  if (playing_) { app_.setStatus(userStopped ? "STOP" : "koniec"); playing_ = false; app_.markDirty(); }
}

void AudioPlayer::startRinging(int alarmIndex) {
  ringing_ = true;
  ringingAlarm_ = alarmIndex;
  ringStartMs_ = millis();
  ringLastRetryMs_ = millis();
  ringErrors_ = 0;
  const AlarmConfig &alarm = app_.alarms().config(alarmIndex);
  app_.setStatus(String("BUDZI: ") + alarm.label);
  app_.markDirty();
  if (!startSound(alarm.sound, alarm.volume)) {
    ringErrors_ = 1;
    ringLastRetryMs_ = millis() - alarmcfg::RING_RETRY_MS;
  }
}

void AudioPlayer::serviceAudio() {
  if (!playing_) return;
  if (!ready_) {
    playing_ = false;
    digitalWrite(pins::PA_ENABLE, LOW);
    if (!ringing_) app_.setStatus("audio stop");
    app_.markDirty();
    return;
  }
  decoder_.loop();
  if (!decoder_.isRunning()) {
    if (ringing_) {
      // connecttoFS() zwraca true dla KAZDEGO istniejacego pliku; uszkodzony MP3
      // "konczy sie" po kilkudziesieciu ms. Bez zliczania budzik krecil sie cicho.
      playing_ = false;
      if (millis() - soundStartedMs_ < alarmcfg::RING_MIN_PLAY_MS) {
        if (++ringErrors_ >= alarmcfg::RING_MAX_ERRORS) {
          app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1;
        }
      } else ringErrors_ = 0;
      app_.markDirty();
      return;
    }
    stopPlayback(StopCause::Auto);
  }
}

void AudioPlayer::serviceRinging() {
  if (!ringing_) return;
  if (millis() - ringStartMs_ > alarmcfg::RING_TIMEOUT_MS) {
    app_.setStatus("budzik: timeout");
    stopPlayback(StopCause::Auto);
    ringing_ = false; ringingAlarm_ = -1;
    app_.markDirty();
    return;
  }
  if (playing_) return;
  if (millis() - ringLastRetryMs_ < alarmcfg::RING_RETRY_MS) return;
  ringLastRetryMs_ = millis();
  if (ringingAlarm_ >= 0) {
    const AlarmConfig &alarm = app_.alarms().config(ringingAlarm_);
    if (startSound(alarm.sound, alarm.volume)) return;
  }
  if (++ringErrors_ >= alarmcfg::RING_MAX_ERRORS) {
    app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1; app_.markDirty();
  }
}

// ============================================================================
//  IMPLEMENTACJE — AlarmScheduler (model + harmonogram wyzwolen)
// ============================================================================
void AlarmScheduler::setDefaults() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    alarms_[i].enabled = 0;
    alarms_[i].hour = 7; alarms_[i].minute = 0; alarms_[i].second = 0;
    alarms_[i].volume = alarmcfg::DEFAULT_VOLUME;
    alarms_[i].sound = (uint8_t)i;
    snprintf(alarms_[i].label, sizeof(alarms_[i].label), "Budzik %d", i + 1);
  }
}

