Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
void AlarmScheduler::resetTriggerState() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) g_persist.lastTriggerDay[i] = -1;
}

// Napraw wpis po odczycie z NVS/formularza: kazde pole sprowadzone do zakresu.
void AlarmScheduler::sanitize(int index) {
  AlarmConfig &alarm = alarms_[index];
  alarm.enabled = alarm.enabled ? 1 : 0;
  if (alarm.hour > 23) alarm.hour = 7;
  if (alarm.minute > 59) alarm.minute = 0;
  if (alarm.second > 59) alarm.second = 0;
  if (alarm.volume > alarmcfg::MAX_VOLUME) alarm.volume = alarmcfg::DEFAULT_VOLUME;
  if (alarm.sound >= alarmcfg::SOUND_COUNT) alarm.sound = (uint8_t)(index % alarmcfg::SOUND_COUNT);
  alarm.label[sizeof(alarm.label) - 1] = '\0';
  if (alarm.label[0] == '\0')
    snprintf(alarm.label, sizeof(alarm.label), "Budzik %d", index + 1);
}

void AlarmScheduler::sanitizeAll() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) sanitize(i);
}

bool AlarmScheduler::anyEnabled() const {
  for (const AlarmConfig &a : alarms_) if (a.enabled) return true;
  return false;
}

// Najblizszy wlaczony budzik (dzis/jutro). Ranking po realnym epoch (mktime).
// Bez waznego czasu zwraca pierwszy wlaczony (delta = indeks).
NextAlarmInfo AlarmScheduler::nextAlarm() const {
  NextAlarmInfo info;
  info.index = -1;
  info.hour = info.minute = info.second = 0;
  info.label[0] = '\0';

  struct tm t;
  bool hasTime = getLocalTm(&t);
  time_t now = hasTime ? time(nullptr) : 0;
  long bestDelta = LONG_MAX;
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    const AlarmConfig &a = alarms_[i];
    if (!a.enabled) continue;
    long delta;
    if (hasTime) delta = (long)(nextOccurrence(t, a.hour, a.minute, a.second, now) - now);
    else delta = i;
    if (delta < bestDelta) {
      bestDelta = delta;
      info.index = i;
      info.hour = a.hour; info.minute = a.minute; info.second = a.second;
      strncpy(info.label, a.label, sizeof(info.label) - 1);
      info.label[sizeof(info.label) - 1] = '\0';
    }
  }
  return info;
}

// Budzik wymagalny PODCZAS dzwonienia innego nie moze przepasc (fix v8.0):
// oznacz go jako wyzwolony (dedup) i zapamietaj — zadzwoni zaraz po zakonczeniu
// biezacego dzwonienia. Deep-sleep nie grozi utrata kolejki: dzwonienie trzyma
// App::busy(), wiec zaden sen nie przerywa tego stanu.
void AlarmScheduler::queueWhileRinging(const struct tm &t, time_t now, uint32_t lateWindowSec) {
  if (pendingAlarm_ >= 0) return;
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    int occurrenceDay;
    if (alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second,
                    lateWindowSec, &occurrenceDay, nullptr) &&
        g_persist.lastTriggerDay[i] != occurrenceDay) {
      g_persist.lastTriggerDay[i] = occurrenceDay;
      pendingAlarm_ = i;
      return;
    }
  }
}

bool AlarmScheduler::firePendingIfAny() {
  if (pendingAlarm_ < 0) return false;
  int index = pendingAlarm_;
  pendingAlarm_ = -1;
  if (!alarms_[index].enabled) return false;   // wylaczony w miedzyczasie przez WWW
  app_.audio().startRinging(index);
  return true;
}

void AlarmScheduler::checkAlarms(uint32_t lateWindowSec) {
  time_t now = time(nullptr);
  struct tm t;
  if (!isSupportedEpoch(now)) return;
  localtime_r(&now, &t);

  if (app_.audioActive()) {              // dzwoni: nie startuj drugiego dzwonienia,
    queueWhileRinging(t, now, lateWindowSec);   // ale nie gub terminow
    return;
  }
  if (firePendingIfAny()) return;

  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    int occurrenceDay;
    time_t dueEpoch;
    if (alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second,
                    lateWindowSec, &occurrenceDay, &dueEpoch) &&
        g_persist.lastTriggerDay[i] != occurrenceDay) {
      g_persist.lastTriggerDay[i] = occurrenceDay;
      // Skonsumuj budziki wymagalne w TEJ SAMEJ CHWILI (kolizja godzin w noc
      // zmiany czasu: 02:30 i 03:30 = ten sam epoch) -> jedno dzwonienie.
      // Porownujemy dokladne epoki wystapien, NIE "due w oknie" — szerokie okno
      // (90 s po korekcie NTP) pozeraloby budziki o roznych terminach (fix v8.0).
      for (int j = 0; j < alarmcfg::ALARM_COUNT; j++) {
        int otherDay;
        time_t otherEpoch;
        if (j != i && alarms_[j].enabled &&
            alarmDueNow(t, now, alarms_[j].hour, alarms_[j].minute, alarms_[j].second,
                        lateWindowSec, &otherDay, &otherEpoch) &&
            otherEpoch == dueEpoch)
          g_persist.lastTriggerDay[j] = otherDay;
      }
      app_.audio().startRinging(i);
      return;
    }
  }
}

bool AlarmScheduler::anyDueNow(const struct tm &t) const {
  time_t now = time(nullptr);
  for (const AlarmConfig &a : alarms_)
    if (a.enabled &&
        alarmDueNow(t, now, a.hour, a.minute, a.second, alarmcfg::LATE_WINDOW_SEC, nullptr, nullptr))
      return true;
  return false;
}

time_t AlarmScheduler::nextEpoch(const struct tm &base, time_t now) const {
  time_t best = 0;
  for (const AlarmConfig &a : alarms_) {
    if (!a.enabled) continue;
    time_t cand = nextOccurrence(base, a.hour, a.minute, a.second, now);
    if (best == 0 || cand < best) best = cand;
  }
  return best;
}

// ============================================================================
//  IMPLEMENTACJE — NetworkTimeService (WiFi + NTP)
//  Czas z RTC pierwszy; NTP NADPISUJE tylko po REALNYM pakiecie (gate atomic).
//  WiFi wlaczone tylko na czas proby.
// ============================================================================
// Jedna semantyka bezpiecznej kopii do bufora (obciecie + terminator).
void NetworkTimeService::copyBounded(char *dst, size_t dstSize, const char *src) {
  strncpy(dst, src ? src : "", dstSize - 1);
  dst[dstSize - 1] = '\0';
}
void NetworkTimeService::setCreds(const char *s, const char *p) {
  copyBounded(ssid_, sizeof(ssid_), s);
  copyBounded(pass_, sizeof(pass_), p);
}
void NetworkTimeService::setSsid(const String &s) { copyBounded(ssid_, sizeof(ssid_), s.c_str()); }
void NetworkTimeService::setPass(const String &p) { copyBounded(pass_, sizeof(pass_), p.c_str()); }

long NetworkTimeService::secsSinceLastSync() const {
  if (g_persist.lastNtpSyncEpoch <= 0) return -1;
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return -1;
  long d = (long)(now - (time_t)g_persist.lastNtpSyncEpoch);
  return d < 0 ? 0 : d;
}

