Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
void NetworkTimeService::stopSntpCallbacks() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  if (esp_sntp_enabled()) esp_sntp_stop();
  sntp_set_time_sync_notification_cb(nullptr);
}

// Rollback po nieudanym NTP: przywroc czas sprzed proby — TYLKO gdy pakiet
// faktycznie zmodyfikowal zegar (g_ntpGotPacket). Nieudana proba bez pakietu
// (timeout, zerwane WiFi) nie ruszyla czasu systemowego, a bezwarunkowy rollback
// cofalby zegar o czas trwania proby, do ~50 s na kazde niepowodzenie (fix v8.0).
void NetworkTimeService::restoreTimeAfterFailedNtp() {
  if (!g_ntpGotPacket.load(std::memory_order_acquire)) return;
  if (isSupportedEpoch(fallbackTime_.tv_sec)) settimeofday(&fallbackTime_, nullptr);
  else setSystemEpoch(0);
}

void NetworkTimeService::stopWifiAndNtp() {
  bool wasAttempting = state_ != NtpState::Idle;
  if (state_ == NtpState::WaitingForPacket) restoreTimeAfterFailedNtp();
  stopSntpCallbacks();
  state_ = NtpState::Idle;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  g_ntpGotPacket.store(false, std::memory_order_release);
  // Przerwano probe, brak waznego czasu i brak zaplanowanego ponowienia -> zaplanuj
  // jedno (backoff), by zegar w koncu zdobyl czas mimo przerwania (np. zamkniecie WWW).
  if (wasAttempting && retriesLeft_ == 0 && !isSupportedEpoch(time(nullptr))) {
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
  }
  wifiPowerOff();
}

bool NetworkTimeService::wifiBeginSmart() {
  WiFi.persistent(false);
#if FAST_NTP_RECONNECT
  if (g_persist.wifiHint) {
    WiFi.begin(ssid_, pass_, g_persist.wifiChannel, g_persist.wifiBssid);
    return true;
  }
#endif
  WiFi.begin(ssid_, pass_);
  return false;
}

void NetworkTimeService::wifiRetryFullScan() {
#if FAST_NTP_RECONNECT
  g_persist.wifiHint = false;
#endif
  WiFi.disconnect(false, false);
  WiFi.begin(ssid_, pass_);
}

void NetworkTimeService::wifiCacheHint() {
#if FAST_NTP_RECONNECT
  if (WiFi.status() == WL_CONNECTED) {
    g_persist.wifiChannel = WiFi.channel();
    const uint8_t *b = WiFi.BSSID();
    if (b) { for (int i = 0; i < 6; i++) g_persist.wifiBssid[i] = b[i]; g_persist.wifiHint = true; }
  }
#endif
}

// Blokujace laczenie WiFi (tylko sciezka panelu WWW; NTP laczy sie nieblokujaco).
bool NetworkTimeService::ensureWifi(uint32_t timeoutMs) {
  if (strlen(ssid_) == 0) return false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);                 // modem-sleep -> mniejszy prad STA
  if (WiFi.status() != WL_CONNECTED) {
    bool usedHint = wifiBeginSmart();
    bool retriedFullScan = false;
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
      if (usedHint && !retriedFullScan && millis() - start >= ntpcfg::WIFI_HINT_FALLBACK_MS) {
        retriedFullScan = true; wifiRetryFullScan();
      }
      delay(100); yield();
      watchdogFeed();                  // blokuje do ~15 s — nie pozwol na falszywy reset
    }
  }
  bool ok = WiFi.status() == WL_CONNECTED;
  if (ok) wifiCacheHint(); else g_persist.wifiHint = false;
  return ok;
}

void NetworkTimeService::scheduleRtcWriteRetry(uint8_t retries) {
  rtcWriteRetriesLeft_ = retries;
  rtcWriteNextRetryMs_ = millis() + rtccfg::WRITE_RETRY_MS;
}

void NetworkTimeService::handleRtcWriteRetry() {
  if (rtcWriteRetriesLeft_ == 0 || (int32_t)(millis() - rtcWriteNextRetryMs_) < 0) return;
  if (app_.rtc().writeTime(time(nullptr), app_.audioActive())) {
    rtcWriteRetriesLeft_ = 0;
    app_.setNtpStatus("NTP OK, RTC OK");
  } else if (--rtcWriteRetriesLeft_ > 0) {
    rtcWriteNextRetryMs_ = millis() + rtccfg::WRITE_RETRY_MS;
    app_.setNtpStatus("NTP OK, RTC retry");
  } else {
    app_.setNtpStatus("NTP OK, RTC ERR");
  }
  app_.markDirty();
}

void NetworkTimeService::finishNtpAttempt(bool ok) {
  bool wasManual = manualAttempt_;
  state_ = NtpState::Idle;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  stopSntpCallbacks();
  g_ntpGotPacket.store(false, std::memory_order_release);

  if (ok) {
    retriesLeft_ = 0;
    backoffMs_ = ntpcfg::BACKOFF_MIN_MS;              // reset backoffu po sukcesie
  } else if (!wasManual && retriesLeft_ > 0) {
    nextRetryMs_ = millis() + ntpcfg::QUICK_RETRY_MS; // dokoncz serie szybka
  } else if (!isSupportedEpoch(time(nullptr))) {
    // Brak waznego czasu -> ponawiaj z BACKOFFEM (1 min -> 1 h). Dotyczy takze
    // proby RECZNEJ (manual ustawia retriesLeft_=0): zegar bez czasu nie moze
    // zostac bez zaplanowanego ponowienia tylko dlatego, ze klikniecie zawiodlo.
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
    backoffMs_ = (backoffMs_ >= ntpcfg::BACKOFF_MAX_MS / 2) ? ntpcfg::BACKOFF_MAX_MS : backoffMs_ * 2;
  }
  if (!app_.web().isActive()) wifiPowerOff();
  app_.markDirty();
}

// Wspolna sciezka porazki w WaitingForPacket: NAJPIERW odetnij SNTP (spozniony
// pakiet nie moze nadpisac przywracanego czasu), potem rollback i zamkniecie proby.
void NetworkTimeService::failNtpAttempt(const char *status) {
  stopSntpCallbacks();
  restoreTimeAfterFailedNtp();
  app_.setNtpStatus(status);
  finishNtpAttempt(false);
}

void NetworkTimeService::beginNtpRequest() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  g_ntpGotPacket.store(false, std::memory_order_release);
  sntp_set_time_sync_notification_cb(onSntpSync);   // PRZED configTzTime
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
  gettimeofday(&fallbackTime_, nullptr);
  g_ntpAcceptPacket.store(true, std::memory_order_release);
  configTzTime(ntpcfg::TZ_POLAND, ntpcfg::SERVER_1, ntpcfg::SERVER_2, ntpcfg::SERVER_3);
  state_ = NtpState::WaitingForPacket;
  wifiLostMs_ = 0;                     // swiezy grace 8 s dla tej proby
  stateStartedMs_ = millis();
  app_.setNtpStatus("oczekiwanie na NTP");
  app_.markDirty();
}

void NetworkTimeService::syncNow(SyncTrigger trigger) {
  if (state_ != NtpState::Idle) return;
  bool manual = (trigger == SyncTrigger::Manual);
  if (manual) retriesLeft_ = 0;
  manualAttempt_ = manual;
  app_.setNtpStatus(manual ? "manual: laczenie WiFi" : "auto: laczenie WiFi");
  app_.markDirty();

  if (strlen(ssid_) == 0) { app_.setNtpStatus("brak SSID WiFi"); finishNtpAttempt(false); return; }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() == WL_CONNECTED) {
    beginNtpRequest();
  } else {
    wifiHintActive_ = wifiBeginSmart();
    state_ = NtpState::WifiConnecting;
    stateStartedMs_ = millis();
  }
}

// Wolane co petle. Zwraca true gdy NTP wlasnie zatwierdzil nowy czas (dla okna budzika).
bool NetworkTimeService::service() {
  if (state_ == NtpState::WifiConnecting) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiCacheHint();
      beginNtpRequest();
    } else if (wifiHintActive_ && millis() - stateStartedMs_ >= ntpcfg::WIFI_HINT_FALLBACK_MS) {
      wifiHintActive_ = false;
      app_.setNtpStatus("WiFi: pelny skan");
      wifiRetryFullScan();
      stateStartedMs_ = millis();
      app_.markDirty();
    } else if (millis() - stateStartedMs_ >= ntpcfg::WIFI_TIMEOUT_MS) {
      app_.setNtpStatus("blad WiFi");
      g_persist.wifiHint = false;
      finishNtpAttempt(false);
    }
    return false;
  }

  if (state_ != NtpState::WaitingForPacket) return false;

