Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  if (g_ntpGotPacket.load(std::memory_order_acquire)) {
    stopSntpCallbacks();                       // zablokuj kolejny pakiet w trakcie zatwierdzania
    time_t syncedEpoch = time(nullptr);
    if (!isSupportedEpoch(syncedEpoch)) {
      restoreTimeAfterFailedNtp();
      app_.setNtpStatus("bledny czas NTP");
      finishNtpAttempt(false);
      return false;
    }
#if ENABLE_RTC_AUTOTRIM
    maybeAutotrimRtc(syncedEpoch);             // pomiar fazowy PRZED nadpisaniem RTC
    syncedEpoch = time(nullptr);               // pomiar mogl potrwac ~1.3 s -> swiezy epoch,
                                               // inaczej writeTime nie wyrowna fazy
#endif
    struct tm local = {};
    localtime_r(&syncedEpoch, &local);

#if ENABLE_DIAGNOSTICS
    { // Dryft: porownaj STARY czas RTC (jeszcze nienadpisany) z czasem NTP.
      time_t oldRtc;
      if (app_.rtc().readEpoch(&oldRtc)) g_persist.lastRtcDriftSec = (int32_t)(oldRtc - syncedEpoch);
      g_persist.prevNtpSyncEpoch = g_persist.lastNtpSyncEpoch;
      g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
    }
#else
    g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
#endif

    bool rtcOk = app_.rtc().writeTime(syncedEpoch, app_.audioActive());
    if (rtcOk) rtcWriteRetriesLeft_ = 0; else scheduleRtcWriteRetry();
    char buf[48];
    snprintf(buf, sizeof(buf), "OK %02d:%02d:%02d RTC:%s",
             local.tm_hour, local.tm_min, local.tm_sec, rtcOk ? "OK" : "RETRY");
    app_.setNtpStatus(buf);
    // Znacznik dobowego synchro 18:00 zalicza WYLACZNIE sync w oknie wieczornym
    // (>=18:00, przed noca). Poranne 06:00 ma wlasny znacznik ntpMorningDay —
    // wspoldzielenie znacznika blokowaloby wieczorna synchronizacje (fix z v6.x).
    if (local.tm_hour >= ntpcfg::DAILY_SYNC_HOUR && local.tm_hour < powercfg::NIGHT_START_HOUR)
      g_persist.ntpStartedDay = localDayKey(local);
    // Udany sync w oknie porannym konsumuje ntpMorningDay: sync odpalony z setup
    // (zimny start / pusty RTC o 06:0x) nie zostanie zdublowany przez checkSchedule;
    // nieudany NIE konsumuje — checkSchedule ma prawo sprobowac ponownie.
    if (local.tm_hour == powercfg::NIGHT_END_HOUR && local.tm_min < ntpcfg::SYNC_MINUTE_WINDOW)
      g_persist.ntpMorningDay = localDayKey(local);
    finishNtpAttempt(true);
    return true;
  }

  // Zerwane WiFi w trakcie oczekiwania: pakiet juz nie nadejdzie. Krotki grace
  // (auto-reconnect czesto wraca po chwili), potem szybkie zakonczenie proby
  // zamiast palenia radia do pelnego PACKET_TIMEOUT_MS (50 s).
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiLostMs_ == 0) {
      wifiLostMs_ = millis();
    } else if (millis() - wifiLostMs_ >= ntpcfg::WIFI_LOST_GRACE_MS) {
      failNtpAttempt("blad NTP (WiFi zerwane)");
      return false;
    }
  } else {
    wifiLostMs_ = 0;
  }

  if (millis() - stateStartedMs_ >= ntpcfg::PACKET_TIMEOUT_MS) {
    failNtpAttempt("blad NTP");
  }
  return false;
}

bool NetworkTimeService::handleNtpRetry() {
  if (state_ != NtpState::Idle) return true;
  if (retriesLeft_ == 0) return false;
  if ((int32_t)(millis() - nextRetryMs_) < 0) return true;
  --retriesLeft_;
  syncNow(SyncTrigger::Scheduled);
  return true;
}

#if ENABLE_RTC_AUTOTRIM
// Autokalibracja offsetu: po kazdym pakiecie NTP zmierz dryft fazowo i — gdy
// okno NTP->NTP jest wiarygodne — przesun rejestr 0x02 tak, by wyzerowac ppm.
// Nowy offset trafia do NVS (przezywa utrate zasilania) i dziala od razu.
// Kwantyzacja 4.34 ppm/LSB zostawia dryf resztkowy do ~0.19 s/dobe.
void NetworkTimeService::maybeAutotrimRtc(time_t syncedEpoch) {
  if (app_.audioActive()) return;                 // pomiar blokuje ~1.3 s -> nie przy audio
  if (!g_persist.rtcPhaseAligned) return;         // faza startu okna nieznana -> ppm bez sensu
  if (g_persist.lastNtpSyncEpoch <= 0) return;
  int64_t windowSec = (int64_t)syncedEpoch - g_persist.lastNtpSyncEpoch;
  if (windowSec < rtccfg::AUTOTRIM_MIN_WINDOW_SEC || windowSec > rtccfg::AUTOTRIM_MAX_WINDOW_SEC) return;

  int64_t driftUs;
  if (!app_.rtc().measureDriftUs(&driftUs)) return;
  float ppm = (float)driftUs / (float)windowSec;  // us/s = ppm
  g_persist.lastDriftPpm = ppm;
  g_persist.lastDriftWindowSec = (int32_t)windowSec;
  if (fabsf(ppm) > rtccfg::AUTOTRIM_MAX_PLAUSIBLE_PPM) return;   // krysztal tak nie plywa -> zly pomiar

  int target = suggestedTotalOffsetLsb(ppm * rtccfg::PPM_SEC_PER_DAY, app_.rtc().offsetLsb());
  if (target == (int)app_.rtc().offsetLsb()) return;             // korekta ponizej 1 LSB
  if (app_.rtc().applyOffsetLsb((int8_t)target)) {
    g_persist.autotrimAdjustCount++;
    app_.settings().saveRtcOffset((int8_t)target);
    Serial.printf("RTC autotrim: %.2f ppm w %lld s -> offset LSB %d\n",
                  ppm, (long long)windowSec, target);
  }
}
#endif

void NetworkTimeService::checkSchedule() {
#if ENABLE_LOW_BATTERY_PROTECT
  // ECO: gdy mamy poprawny czas, NIE budz WiFi do auto-sync (najwiekszy pobor).
  // Pusty RTC -> pozwol sie synchronizowac mimo niskiej baterii (zegar musi miec czas).
  if (app_.battery().isLow() && isSupportedEpoch(time(nullptr))) return;
#endif
  if (handleNtpRetry()) return;
  struct tm t;
  if (!getLocalTm(&t)) return;
  int day = localDayKey(t);
  // Preferowane okno 18:00-18:05; pominiete -> dogon do poczatku nocy. ntpStartedDay
  // gwarantuje DOKLADNIE jeden sync/dobe.
  bool preferredWindow = (t.tm_hour == ntpcfg::DAILY_SYNC_HOUR && t.tm_min <= ntpcfg::SYNC_MINUTE_WINDOW);
  bool catchupWindow   = (t.tm_hour >= ntpcfg::DAILY_SYNC_HOUR && t.tm_hour < powercfg::NIGHT_START_HOUR);
  if ((preferredWindow || catchupWindow) && g_persist.ntpStartedDay != day) {
    g_persist.ntpStartedDay = day;
    retriesLeft_ = 2;
    syncNow(SyncTrigger::Scheduled);
    return;
  }
  // Poranne NTP 06:00-06:05 (wlasny znacznik ntpMorningDay — NIE konsumuje
  // straznika okna wieczornego). W v7.0 to okno zylo tylko w setup(): urzadzenie
  // czuwajace przez 06:00 (dzwoniacy budzik, otwarte WWW) gubilo poranny sync na
  // caly dzien (fix v8.0). Po wybudzeniu z nocy pierwszy obieg loop() trafia tu
  // natychmiast, wiec timing wzgledem v7.0 bez zmian.
  if (t.tm_hour == powercfg::NIGHT_END_HOUR && t.tm_min < ntpcfg::SYNC_MINUTE_WINDOW &&
      g_persist.ntpMorningDay != day) {
    g_persist.ntpMorningDay = day;
    retriesLeft_ = 2;
    syncNow(SyncTrigger::Scheduled);
  }
}

// ============================================================================
//  IMPLEMENTACJE — DisplayUi (U8g2, panel ST7305)
// ============================================================================
// Ten egzemplarz ST7305 NIE przywraca obrazu po deep-sleep przez sam initInterface()
// -> pelny re-init (reset RST + begin) przy KAZDYM wejsciu w setup (zimny start
// ORAZ po deep-sleep). W dzien petla uzywa light-sleep (setup() sie nie powtarza)
// -> panel trzyma obraz -> brak mrugania. Tryb LPM panelu jest nieprzetestowany
// i celowo NIE jest wysylany.
void DisplayUi::setup() {
  constexpr uint32_t RESET_PULSE_MS = 10;
  pinMode(pins::LCD_RST, OUTPUT);
  digitalWrite(pins::LCD_RST, HIGH);
  digitalWrite(pins::LCD_RST, LOW);
  delay(RESET_PULSE_MS);
  digitalWrite(pins::LCD_RST, HIGH);
  delay(RESET_PULSE_MS);
  // HW SPI: usuwa ~4 s opoznienia pelnego sendBuffer().
  SPI.begin(pins::LCD_SCK, -1, pins::LCD_MOSI, pins::LCD_CS);
  panel_.setBusClock(lcd::SPI_BUS_HZ);
  panel_.begin();
  panel_.setContrast(lcd::CONTRAST);
}

