Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
void DisplayUi::drawPhotoGlyph(int x, int y, int glyph, bool colon) {
  uint16_t p = colon ? PHOTO_COLON_OFFSET : pgm_read_word(&PHOTO_DIGIT_OFFSET[glyph]);
  for (int row = 0; row < PHOTO_DIGIT_H; row++) {
    uint8_t segs = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
    for (uint8_t i = 0; i < segs; i++) {
      uint8_t start = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      uint8_t width = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      panel_.drawHLine(x + start, y + row, width);
    }
  }
  // Font (Impact) ma skrocona dolna stopke cyfry 4 — uzupelniamy ja tutaj.
  // Wspolrzedne sprzezone z PHOTO_DIGIT_W/H; zmiana fontu = rewizja tych prostokatow.
  if (!colon && glyph == 4) {
    constexpr int DIGIT4_PATCH1_X = 39, DIGIT4_PATCH1_Y = 112, DIGIT4_PATCH1_W = 41, DIGIT4_PATCH1_H = 13;
    constexpr int DIGIT4_PATCH2_X = 40, DIGIT4_PATCH2_Y = 125, DIGIT4_PATCH2_W = 31, DIGIT4_PATCH2_H = 25;
    panel_.drawBox(x + DIGIT4_PATCH1_X, y + DIGIT4_PATCH1_Y, DIGIT4_PATCH1_W, DIGIT4_PATCH1_H);
    panel_.drawBox(x + DIGIT4_PATCH2_X, y + DIGIT4_PATCH2_Y, DIGIT4_PATCH2_W, DIGIT4_PATCH2_H);
  }
}

void DisplayUi::drawLargeTime(uint8_t hour, uint8_t minute, int y) {
  int totalW = PHOTO_DIGIT_W * 4 + PHOTO_COLON_W + PHOTO_DIGIT_GAP * 4;
  int x = (lcd::WIDTH - totalW) / 2 + PHOTO_TIME_X_SHIFT;
  drawPhotoGlyph(x, y, hour / 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, hour % 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x + PHOTO_COLON_X_SHIFT, y + PHOTO_COLON_Y_SHIFT, 0, true);
  x += PHOTO_COLON_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute / 10, false); x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute % 10, false);
}

void DisplayUi::drawBellIcon(int x, int y, bool active) {
  panel_.setDrawColor(1);
  panel_.drawDisc(x + 12, y + 10, 8);
  panel_.drawBox(x + 5, y + 10, 15, 11);
  panel_.drawBox(x + 3, y + 20, 19, 4);
  panel_.drawDisc(x + 12, y + 25, 3);
  panel_.drawBox(x + 9, y + 3, 7, 4);
  if (!active) {                                   // przekreslenie: budziki wylaczone
    panel_.drawLine(x + 1, y + 26, x + 25, y + 2);
    panel_.drawLine(x + 2, y + 26, x + 26, y + 2);
  }
}

void DisplayUi::drawBatteryIcon(int x, int y, uint8_t percent) {
  if (percent > 100) percent = 100;
  panel_.drawFrame(x, y, 28, 13);                  // korpus 28x13 + nosek
  panel_.drawBox(x + 28, y + 4, 3, 5);
  int fill = map(percent, 0, 100, 0, 24);
  if (fill > 0) panel_.drawBox(x + 2, y + 2, fill, 9);
  char txt[8];
  snprintf(txt, sizeof(txt), "%u%%", percent);
  panel_.setFont(u8g2_font_7x14_tf);
  panel_.drawStr(x - 42, y + 12, txt);             // etykieta % na lewo od ikony
}

void DisplayUi::drawCentered(const char *text, int y) {
  int w = panel_.getStrWidth(text);
  int x = (lcd::WIDTH - w) / 2;
  if (x < 0) x = 0;
  panel_.drawStr(x, y, text);
}

UiPage DisplayUi::resolvePage() const {
  if (app_.audioActive()) return UiPage::Ringing;              // stan nadrzedny: dzwoni budzik
  if (app_.buttons().previewActive()) return UiPage::Preview;  // wygasniecie rozstrzyga update()
  struct tm t;
  if (!getLocalTm(&t)) return UiPage::NoTime;
  return UiPage::Clock;
}

ClockView DisplayUi::makeClockView(const struct tm &t, int dayKey) const {
  NextAlarmInfo next = app_.alarms().nextAlarm();
  ClockView v;
  v.hour            = (uint8_t)t.tm_hour;
  v.minute          = (uint8_t)t.tm_min;
  v.dayKey          = dayKey;
  v.batteryPercent  = app_.battery().percent();
  v.webActive       = app_.web().isActive();
  v.anyAlarmEnabled = app_.alarms().anyEnabled();
  v.hasNextAlarm    = next.valid();
  v.nextAlarmHour   = next.hour;
  v.nextAlarmMinute = next.minute;
  return v;
}

void DisplayUi::drawClockPage(const ClockView &view) {
  panel_.clearBuffer();
  panel_.setDrawColor(1);
  drawBatteryIcon(BATTERY_ICON_X, BATTERY_ICON_Y, view.batteryPercent);

  int y = (lcd::HEIGHT - PHOTO_DIGIT_H) / 2 + PHOTO_TIME_Y_SHIFT;
  drawLargeTime(view.hour, view.minute, y);

  panel_.drawHLine(0, FOOTER_LINE_Y, lcd::WIDTH);
  drawBellIcon(FOOTER_BELL_X, FOOTER_BELL_Y, view.anyAlarmEnabled);
  panel_.setFont(u8g2_font_7x14_tf);
  char bottom[80];
  if (view.hasNextAlarm)
    snprintf(bottom, sizeof(bottom), "Budzik %02u:%02u %s  Aku %u%%  WWW:%s",
             view.nextAlarmHour, view.nextAlarmMinute, view.anyAlarmEnabled ? "ON" : "OFF",
             view.batteryPercent, view.webActive ? "ON" : "OFF");
  else
    snprintf(bottom, sizeof(bottom), "Budzik --:-- OFF  Aku %u%%  WWW:%s",
             view.batteryPercent, view.webActive ? "ON" : "OFF");
  panel_.drawStr(FOOTER_TEXT_X, FOOTER_TEXT_Y, bottom);
  panel_.sendBuffer();
}

void DisplayUi::drawPreviewPage() {
  NextAlarmInfo next = app_.alarms().nextAlarm();

  panel_.clearBuffer();
  panel_.setDrawColor(1);
  drawBatteryIcon(BATTERY_ICON_X, BATTERY_ICON_Y, app_.battery().percent());
  if (next.valid()) {
    drawBellIcon(FOOTER_BELL_X, 8, true);
    panel_.setFont(u8g2_font_9x15_tf);
    drawCentered("NAJBLIZSZY BUDZIK", 25);
    drawLargeTime(next.hour, next.minute, 60);
    panel_.drawHLine(0, FOOTER_LINE_Y, lcd::WIDTH);
    char detail[96];
    snprintf(detail, sizeof(detail), "%s  %02u:%02u:%02u  [%s]",
             next.label, next.hour, next.minute, next.second,
             alarmcfg::SOUND_NAMES[app_.alarms().config(next.index).sound % alarmcfg::SOUND_COUNT]);
    drawCentered(detail, FOOTER_TEXT_Y);
  } else {
    drawBellIcon(185, 35, false);
    panel_.setFont(u8g2_font_logisoso50_tf);
    drawCentered("--:--", 150);
    panel_.setFont(u8g2_font_9x15_tf);
    drawCentered("Brak aktywnego budzika", 215);
  }
  panel_.sendBuffer();
  lastClockSig_ = FORCE_REPAINT_SIG;   // powrot do zegara wymusi repaint
}

void DisplayUi::drawRingingPage() {
  panel_.clearBuffer();
  panel_.setDrawColor(1);
  drawBatteryIcon(BATTERY_ICON_X, BATTERY_ICON_Y, app_.battery().percent());
  drawBellIcon(185, 35, true);
  panel_.setFont(u8g2_font_logisoso50_tf);
  drawCentered("BUDZIK", 150);
  panel_.setFont(u8g2_font_9x15_tf);
  drawCentered(app_.statusText().c_str(), 210);
  drawCentered("Przycisk = wycisz", 245);
  panel_.sendBuffer();
  lastClockSig_ = FORCE_REPAINT_SIG;
}

void DisplayUi::drawNightPage() {
  panel_.clearBuffer();
  panel_.setDrawColor(1);
  panel_.setFont(u8g2_font_7x14_tf);
  char text[40];
  snprintf(text, sizeof(text), "TRYB NOCNY %02d:%02d - %02d:%02d",
           powercfg::NIGHT_START_HOUR, powercfg::NIGHT_START_MIN,
           powercfg::NIGHT_END_HOUR, powercfg::NIGHT_END_MIN);
  drawCentered(text, 150);
  panel_.sendBuffer();
  app_.clearDirty();
  lastClockSig_ = FORCE_REPAINT_SIG;
}

#if ENABLE_LOW_BATTERY_PROTECT
void DisplayUi::drawCriticalBatteryPage() {
  panel_.clearBuffer();
  panel_.setDrawColor(1);
  drawBatteryIcon(BATTERY_ICON_X, BATTERY_ICON_Y, app_.battery().percent());
  panel_.setFont(u8g2_font_logisoso32_tf);
  drawCentered("ROZLADOWANY", 120);
  panel_.setFont(u8g2_font_9x15_tf);
  drawCentered("Podlacz ladowarke", 165);
  char b[40];
  snprintf(b, sizeof(b), "%u%%  %.2f V", app_.battery().percent(), app_.battery().voltage());
  drawCentered(b, 200);
  panel_.sendBuffer();
  lastClockSig_ = FORCE_REPAINT_SIG;
}
#endif

