Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
void DisplayUi::drawNoTimePage() {
  panel_.clearBuffer();
  panel_.setDrawColor(1);
  panel_.setFont(u8g2_font_9x15_tf);
  drawCentered("Brak czasu RTC/NTP", 135);
  drawCentered(app_.ntpStatus().c_str(), 170);
  panel_.sendBuffer();
  lastClockSig_ = FORCE_REPAINT_SIG;
}

// Strony NoTime/Clock — wspolne zakonczenie update() oraz wygasniecia podgladu.
void DisplayUi::renderTimePages() {
  struct tm t;
  if (!getLocalTm(&t)) {
    if (app_.dirty()) {
      drawNoTimePage();
      app_.clearDirty();
    }
    return;
  }
  // Strona zegara — repaint TYLKO gdy zmienia sie WIDOCZNA tresc (sygnatura widoku).
  int dayKey = localDayKey(t);
  ClockView view = makeClockView(t, dayKey);
  uint32_t sig = view.signature();
  if (sig != lastClockSig_) {
    drawClockPage(view);
    lastClockSig_ = sig;
  }
  app_.clearDirty();
}

void DisplayUi::update() {
  switch (resolvePage()) {
    case UiPage::Ringing:
      if (app_.dirty()) { drawRingingPage(); app_.clearDirty(); }
      return;

    case UiPage::Preview:
      if (app_.buttons().previewWithinWindow()) {
        if (app_.dirty()) { drawPreviewPage(); app_.clearDirty(); }
        return;
      }
      app_.buttons().clearPreview();   // okno podgladu uplynelo -> wroc na strony czasu
      app_.markDirty();
      break;

    case UiPage::NoTime:
    case UiPage::Clock:
      break;
  }
  renderTimePages();
}

// ============================================================================
//  IMPLEMENTACJE — WebPanel (panel konfiguracyjny WWW)
// ============================================================================
static bool removeIfExists(fs::FS &fs, const String &path) {
  return fs.exists(path) && fs.remove(path);
}

void WebPanel::redirectHome() {
  server_.sendHeader("Location", "/");
  server_.send(303, "text/plain", "");
}

void WebPanel::appendMp3Manager(String &html) {
  html += F("<section><b>Pliki MP3</b>");
  if (!app_.soundStore().ensureMounted()) { html += F("<p>Brak zamontowanego systemu plikow.</p></section>"); return; }
  html += F("<p class='muted'>System plikow: "); html += htmlEscape(app_.soundStore().name());
  html += F("</p><form method='post' action='/mp3upload' enctype='multipart/form-data'>"
            "<div class='row'><input type='file' name='mp3' accept='.mp3,audio/mpeg' required>"
            "<button type='submit'>Dodaj / nadpisz MP3</button></div></form>");
  html += F("<table><tr><th>Plik</th><th>Rozmiar</th><th></th></tr>");
  bool any = false;
  File root = app_.soundStore().fs()->open("/");
  if (root) {
    for (File file = root.openNextFile(); file; file = root.openNextFile()) {
      if (!file.isDirectory()) {
        String path = file.name();
        if (!path.startsWith("/")) path = String("/") + path;
        String lower = path; lower.toLowerCase();
        if (lower.endsWith(".mp3")) {
          any = true;
          html += F("<tr><td>"); html += htmlEscape(path);
          html += F("</td><td>"); html += formatFileSize(file.size());
          html += F("</td><td><form method='post' action='/mp3delete' style='display:inline'>"
                    "<input type='hidden' name='file' value='"); html += htmlEscape(path);
          html += F("'><button type='submit'>Usun</button></form></td></tr>");
        }
      }
      file.close();
    }
    root.close();
  }
  if (!any) html += F("<tr><td colspan='3'>Brak plikow MP3</td></tr>");
  html += F("</table><p class='muted'>Nazwy: litery/cyfry oraz _ - ., maks. 25 znakow; budziki uzywaja /alarm1.mp3, /alarm2.mp3, /alarm3.mp3.</p></section>");
}

void WebPanel::pageHeader(String &h) {
  h += F("<!doctype html><html><head><meta charset='utf-8'>"
         "<meta name='viewport' content='width=device-width,initial-scale=1'>"
         "<title>Zegar NTP</title><style>"
         "body{font-family:system-ui,Arial;margin:16px;background:#f5f5f5;color:#111}"
         "main{max-width:760px;margin:auto}section{background:#fff;border:1px solid #ddd;padding:12px;margin:12px 0}"
         "input,button,select{font:inherit;padding:6px;margin:3px}label{display:inline-block;margin:4px 8px 4px 0}"
         "table{width:100%;border-collapse:collapse}td,th{border-bottom:1px solid #ddd;padding:6px;text-align:left}"
         ".row{display:flex;gap:8px;flex-wrap:wrap;align-items:center}.muted{color:#666}"
         "</style></head><body><main><h1>Zegar NTP — 3 budziki</h1>"
         "<p class='muted'>" FW_NAME " v" FW_VERSION " &middot; build " FW_BUILD_DATE " " FW_BUILD_TIME "</p>");
}

void WebPanel::handleRoot() {
  extendWindow();
  app_.battery().update(false);   // bez wymuszania: pod WiFi pomiar zanizony, OCV po zamknieciu WWW
  String html; html.reserve(webcfg::HTML_ROOT_RESERVE);
  pageHeader(html);

  html += F("<section><b>Status</b><p>Czas: "); html += currentTimeText();
  html += F("<br>Budzik: ");     html += htmlEscape(app_.statusText());
  html += F("<br>NTP: ");        html += htmlEscape(app_.ntpStatus());
  html += F("<br>Pliki MP3: ");  html += htmlEscape(app_.soundStore().name());
  html += F("<br>Akumulator: "); html += app_.battery().percent();
  html += F("% (");              html += String(app_.battery().voltage(), 2);
  html += F(" V, ok. ");         html += String((uint32_t)app_.battery().percent() * batcfg::CAPACITY_MAH / 100U);
  html += F(" mAh)<br>IP: ");    html += WiFi.localIP().toString();
  {
    float perDay = app_.persist().drain.mahPerDay();
    float daysLeft = app_.persist().drain.daysRemaining(app_.battery().percent());
    html += F("<br>Zuzycie: ");
    if (perDay < 0)       html += F("zbieram dane (min ~12 h)");
    else if (perDay == 0) html += F("brak mierzalnego zuzycia");
    else { html += String(perDay, 1); html += F(" mAh/dzien, ~"); html += String(daysLeft, 0); html += F(" dni do rozladowania"); }
  }
  html += F("</p><p><a href='/sync'><button>Synchronizuj NTP</button></a>"
            "<a href='/stop'><button>Stop MP3</button></a>");
#if ENABLE_DIAGNOSTICS
  html += F("<a href='/info'><button>Informacje</button></a>");
#endif
  html += F("<a href='/off'><button>Wylacz panel WWW</button></a>");
  html += F("</p></section>");

  html += F("<form method='post' action='/save'>");
  // Hasla nie renderujemy (panel bez logowania; kazdy w LAN odczytalby je ze zrodla).
  html += F("<section><b>WiFi</b><div class='row'><label>SSID <input name='ssid' value='");
  html += htmlEscape(app_.ntp().ssid());
  html += F("'></label><label>Haslo <input name='pass' type='password' placeholder='(bez zmian)'>"
            "</label></div><p class='muted'>Puste pole hasla = haslo bez zmian.</p></section>");

