Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
  bool rtcAlarmOk = app_.rtc().setWakeAlarm(wakeAt);
  // INT juz w stanie LOW = alarm odpaliłby natychmiast lub pin jest wadliwy ->
  // nie ufaj mu tej nocy.
  if (rtcAlarmOk && digitalRead(pins::RTC_INT) != HIGH) {
    app_.rtc().disableWakeAlarm();
    rtcAlarmOk = false;
  }
  // Bez dzialajacego alarmu RTC budzi tylko timer ESP na niedokladnym RC: spij w
  // odcinkach, by kazde wybudzenie zakotwiczylo czas z PCF85063A (setup) i dryft
  // pojedynczego odcinka byl << okno wylapania budzika.
  if (!rtcAlarmOk) {
    bool alarmIsNextEvent = (alarmAt > now && wakeAt == alarmAt);
    uint64_t cap = alarmIsNextEvent ? powercfg::NIGHT_FALLBACK_ALARM_CHUNK_SEC
                                    : powercfg::NIGHT_FALLBACK_CHUNK_SEC;
    if (sleepSec > cap) sleepSec = cap;
  }
  Serial.printf("Tryb nocny: sleep %llu s, RTC alarm: %s\n",
                (unsigned long long)sleepSec, rtcAlarmOk ? "OK" : "ERR");
  app_.displayUi().drawNightPage();
  uint64_t wakeMask = (1ULL << pins::KEY) | (1ULL << pins::PREVIEW);
  if (rtcAlarmOk) wakeMask |= (1ULL << pins::RTC_INT);
  beginDeepSleep(sleepSec * 1000000ULL, wakeMask);
}

// Dynamiczny light-sleep w dzien: spij do granicy nastepnej minuty lub do sekundy
// najblizszego budzika, max 60 s. RLCD trzyma obraz; przyciski wybudzaja przez EXT1.
// Light-sleep NIE rebootuje -> setup() sie nie powtarza -> brak mrugania.
uint64_t PowerPlanner::computeIdleSleepUs() {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return powercfg::IDLE_LIGHT_SLEEP_US;   // czas nieznany -> krotki sen
  struct tm t; localtime_r(&now, &t);
  uint64_t sleepSec = 60 - (uint64_t)t.tm_sec;             // do granicy minuty
  time_t alarmAt = app_.alarms().nextEpoch(t, now);
  if (alarmAt > now) {
    uint64_t toAlarm = (uint64_t)(alarmAt - now);
    if (toAlarm < sleepSec) sleepSec = toAlarm;
  }
  if (sleepSec > powercfg::IDLE_LIGHT_SLEEP_MAX_SEC) sleepSec = powercfg::IDLE_LIGHT_SLEEP_MAX_SEC;
  if (sleepSec < 1) sleepSec = 1;
  return sleepSec * 1000000ULL;
}

void PowerPlanner::idlePowerSave() {
  // Nie usypiaj na dlugo, gdy cos wymaga szybkiej obslugi (App::busy) lub trwa
  // okno utrzymania wybudzenia po nacisnieciu przycisku (ButtonInput::wakeHeld).
  if (app_.busy() || app_.buttons().wakeHeld()) { delay(5); return; }
  if (digitalRead(pins::KEY) == LOW || digitalRead(pins::PREVIEW) == LOW) { delay(5); return; }

  if (app_.audio().codecActive()) app_.audio().shutdownCodec();   // kodek niepotrzebny -> uspij ES8311

  esp_sleep_enable_timer_wakeup(computeIdleSleepUs());
  const uint64_t wakeMask = (1ULL << pins::KEY) | (1ULL << pins::PREVIEW);
  esp_err_t extWake = esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
  // UWAGA SPRZETOWA: NIE dodawac tu esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, OFF)
  // — flash wisi na tej szynie; odciecie konczylo sie rebootem i cichym budzikiem.
  watchdogFeed();
  esp_light_sleep_start();
  watchdogFeed();
  // EXT1 zostawia RTC-hold na padach wybudzajacych — zwolnij od razu, inaczej
  // digitalRead zwraca zatrzasniety stan i przyciski sa martwe do restartu.
  rtc_gpio_hold_dis(pins::KEY);
  rtc_gpio_hold_dis(pins::PREVIEW);
  esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  uint64_t wakePins = wakeCause == ESP_SLEEP_WAKEUP_EXT1 ? esp_sleep_get_ext1_wakeup_status() : 0;
  esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
  if (extWake == ESP_OK) esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_EXT1);

  // Po light-sleep czas systemowy szedl z mniej dokladnego RTC slow clock —
  // zakotwicz ponownie z PCF85063A, by dryft nie przesuwal zmiany minuty.
  app_.rtc().readToSystem();

  if (wakeCause == ESP_SLEEP_WAKEUP_EXT1) {
    if (wakePins & (1ULL << pins::KEY))     app_.buttons().primeKeyFromLightSleepWake();
    if (wakePins & (1ULL << pins::PREVIEW)) app_.buttons().onPreviewWakeFromLightSleep();
  }
}

// ============================================================================
//  IMPLEMENTACJE — ButtonInput (polityka przyciskow)
// ============================================================================
void ButtonInput::begin() {
  keyButton_.begin();
  previewButton_.begin();
}

void ButtonInput::pollKey() {
  switch (keyButton_.poll()) {
    case ButtonEvent::Pressed:
      holdWake();
      break;
    case ButtonEvent::Released:
      // Zwolnienie po dlugim (>= KEY_LONG_PRESS_MS) przytrzymaniu: celowo BEZ akcji
      // (dlugie przytrzymanie tylko tlumi akcje krotka). begin()/primePressed()
      // zawsze uzbrajaja pomiar, wiec kontrakt obowiazuje takze dla KEY trzymanego
      // od zimnego startu (fix v8.0 — v7.0 odpalal wtedy panel WWW).
      if (keyButton_.lastPressKnown() &&
          keyButton_.lastPressDurationMs() < btncfg::KEY_LONG_PRESS_MS) {
        if (app_.audioActive()) app_.audio().stopPlayback(StopCause::User);  // dzwoni -> wycisz
        else app_.web().startWebWindow();                                    // nie dzwoni -> panel WWW
      }
      break;
    case ButtonEvent::None:
      break;
  }
}

void ButtonInput::pollPreview() {
  switch (previewButton_.poll()) {
    case ButtonEvent::Pressed:
      holdWake();
      break;
    case ButtonEvent::Released:
      // Tylko krotki, zmierzony klik pokazuje podglad; dluzsze przytrzymanie
      // (> BOOT_SHORT_PRESS_MAX_MS) celowo bez akcji.
      if (previewButton_.lastPressKnown() &&
          previewButton_.lastPressDurationMs() <= btncfg::BOOT_SHORT_PRESS_MAX_MS) {
        showPreview();
      }
      break;
    case ButtonEvent::None:
      break;
  }
}

void ButtonInput::showPreview() {
  if (app_.audioActive()) return;   // dzwonienie ma pierwszenstwo przed podgladem
  previewActive_ = true;
  previewUntilMs_ = millis() + btncfg::PREVIEW_SHOW_MS;
  holdWake();
  app_.markDirty();
}

void ButtonInput::primeKeyFromSetup() {
  keyButton_.primePressed();
}

void ButtonInput::primeKeyFromLightSleepWake() {
  keyButton_.primePressed();
  holdWake();
}

void ButtonInput::onPreviewWakeFromLightSleep() {
  previewButton_.primePressed();
  showPreview();
}

// ============================================================================
//  IMPLEMENTACJE — SettingsStore (NVS + diagnostyka resetu)
// ============================================================================
void SettingsStore::load() {
  app_.alarms().setDefaults();
  NvsSession session(prefs_);
  if (!session) {
    app_.ntp().setCreds(ntpcfg::DEFAULT_SSID, ntpcfg::DEFAULT_PASS);
    return;
  }
  if (prefs_.getBytesLength(nvskeys::ALARMS) == app_.alarms().rawSize())
    prefs_.getBytes(nvskeys::ALARMS, app_.alarms().rawData(), app_.alarms().rawSize());
  app_.alarms().sanitizeAll();
  String ssid = prefs_.getString(nvskeys::WIFI_SSID, ntpcfg::DEFAULT_SSID);
  String pass = prefs_.getString(nvskeys::WIFI_PASS, ntpcfg::DEFAULT_PASS);
  if (ssid.length() == 0) { ssid = ntpcfg::DEFAULT_SSID; pass = ntpcfg::DEFAULT_PASS; }
  app_.ntp().setCreds(ssid.c_str(), pass.c_str());
#if ENABLE_RTC_AUTOTRIM
  // Wykalibrowany offset przezywa utrate zasilania w NVS; brak klucza = start
  // z fabrycznego FACTORY_OFFSET_REG. Wczytany PRZED ensureOffsetCalibration().
  app_.rtc().setTargetOffsetLsb(
    (int8_t)prefs_.getChar(nvskeys::RTC_OFFSET_LSB, decodeRtcOffset(rtccfg::FACTORY_OFFSET_REG)));
#endif
}

