Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v8.0.ino
void SettingsStore::save() {
  NvsSession session(prefs_);
  if (!session) return;
  prefs_.putBytes(nvskeys::ALARMS, app_.alarms().rawData(), app_.alarms().rawSize());
  prefs_.putString(nvskeys::WIFI_SSID, app_.ntp().ssid());
  prefs_.putString(nvskeys::WIFI_PASS, app_.ntp().pass());
}

// Zwiezle podsumowanie zuzycia baterii, nadpisywane max raz/dobe (malo flash).
void SettingsStore::saveDrainSummary(uint8_t soc, float mahPerDay, int day) {
  NvsSession session(prefs_);
  if (!session) return;
  prefs_.putUShort(nvskeys::DRAIN_SOC, soc);
  prefs_.putFloat(nvskeys::DRAIN_MAH_DAY, mahPerDay);
  prefs_.putUInt(nvskeys::DRAIN_DAY, (uint32_t)day);
}

#if ENABLE_RTC_AUTOTRIM
void SettingsStore::saveRtcOffset(int8_t lsb) {
  NvsSession session(prefs_);
  if (!session) return;
  prefs_.putChar(nvskeys::RTC_OFFSET_LSB, lsb);
}
#endif

#if ENABLE_DIAGNOSTICS
// Wczytaj dozywotnie liczniki resetow i — jesli ten rozruch to brownout/panic/WDT
// — zwieksz odpowiedni. Zdarzenia rzadkie, wiec zapis do flash bezpieczny.
void SettingsStore::recordResetReason(esp_reset_reason_t r) {
  NvsSession session(prefs_);
  if (!session) return;
  brownoutResets_ = prefs_.getUInt(nvskeys::RESETS_BROWNOUT, 0);
  wdtResets_      = prefs_.getUInt(nvskeys::RESETS_WDT,      0);
  panicResets_    = prefs_.getUInt(nvskeys::RESETS_PANIC,    0);
  if (r == ESP_RST_BROWNOUT)                                                  prefs_.putUInt(nvskeys::RESETS_BROWNOUT, ++brownoutResets_);
  else if (r == ESP_RST_TASK_WDT || r == ESP_RST_INT_WDT || r == ESP_RST_WDT) prefs_.putUInt(nvskeys::RESETS_WDT,      ++wdtResets_);
  else if (r == ESP_RST_PANIC)                                                prefs_.putUInt(nvskeys::RESETS_PANIC,    ++panicResets_);
}
#endif

// ============================================================================
//  IMPLEMENTACJE — App (orkiestracja setup/loop)
// ============================================================================
void App::setup() {
  // Przyczyne wybudzenia klasyfikujemy NAJPIERW — decyduje o zerowaniu stanu,
  // opoznieniu USB-CDC i akcjach po wybudzeniu.
  const WakeInfo wake = WakeInfo::classify();

  Serial.begin(115200);
  if (wake.coldBoot) delay(COLD_BOOT_SERIAL_DELAY_MS);   // tylko zimny start (USB-CDC)
  setCpuFrequencyMhz(powercfg::DAY_CPU_MHZ);
  watchdogSetup();
  power_.releaseNightHolds();     // MUSI poprzedzac dotykanie pinow LCD/PA (holdy z nocy)
  amplifierOff();
  display_.setup();

  if (wake.coldBoot) {            // RTC RAM przezywa deep-sleep -> zeruj tylko na zimnym starcie
    alarms_.resetTriggerState();
    g_persist.ntpStartedDay = -1;
    g_persist.ntpMorningDay = -1;
    g_persist.batteryHasReading = false; g_persist.batteryPercent = 0; g_persist.batteryVoltage = 0.0f;
    g_persist.drain.valid = false;
    g_persist.lastSummaryDay = -1;
    g_persist.wifiHint = false;
    g_persist.bootCount = 0;
    g_persist.coldBootEpoch = 0;
    g_persist.lastRtcDriftSec = 0;
    g_persist.lastNtpSyncEpoch = 0;
    g_persist.prevNtpSyncEpoch = 0;
#if ENABLE_RTC_AUTOTRIM
    g_persist.rtcPhaseAligned = false;
    g_persist.lastDriftPpm = 0.0f;
    g_persist.lastDriftWindowSec = 0;
    g_persist.autotrimAdjustCount = 0;
#endif
  }
  g_persist.bootCount++;

  setenv("TZ", ntpcfg::TZ_POLAND, 1);
  tzset();

  pinMode(pins::RTC_INT, INPUT_PULLUP);
  buttons_.begin();

  settings_.load();               // wczytuje m.in. offset RTC z NVS (PRZED kalibracja!)
#if ENABLE_DIAGNOSTICS
  settings_.recordResetReason(esp_reset_reason());
#endif
  Serial.printf("\n=== %s v%s  (build %s %s) ===\n", FW_NAME, FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
  Serial.printf("Rozruch #%u, przyczyna resetu: %s\n", g_persist.bootCount, resetReasonText(esp_reset_reason()));
  battery_.update(true);

  bool timeFromRtc = rtc_.readToSystem();
  rtc_.ensureOffsetCalibration();        // kalibracja dryfu (0x02) + odczyt zwrotny
  bool rtcAlarmCleared = rtc_.disableWakeAlarm();
  setNtpStatus(timeFromRtc ? "czas z RTC" : "RTC pusty/brak");
  if (wake.rtcWake && !rtcAlarmCleared) setNtpStatus("RTC alarm: blad kasowania");
#if ENABLE_DIAGNOSTICS
  { time_t t0 = time(nullptr);
    if (g_persist.coldBootEpoch == 0 && isSupportedEpoch(t0)) g_persist.coldBootEpoch = (int64_t)t0; }
#endif

  audio_.codecPowerDown();               // ES8311 startuje w stanie niskiego poboru

  if (wake.coldBoot) soundStore_.ensureMounted();   // FS tylko do MP3 — montuj leniwie
  alarms_.checkAlarms(wake.scheduledWake() ? ntpcfg::ALARM_CATCHUP_SEC : alarmcfg::LATE_WINDOW_SEC);
  if (!wake.userWake() && !audio_.isRinging()) power_.enterNightSleepIfNeeded(true);
#if ENABLE_LOW_BATTERY_PROTECT
  if (!wake.userWake() && !audio_.isRinging()) power_.enterCriticalBatterySleepIfNeeded();
#endif

  // WiFi domyslnie OFF. Sync NTP z setup: zimny start lub pusty RTC. Poranne
  // okno 06:00 obsluguje NetworkTimeService::checkSchedule() w loop() (fix v8.0:
  // dziala takze, gdy urzadzenie czuwalo przez 06:00 i setup sie nie wykonal).
  bool willSync = (wake.coldBoot || !timeFromRtc);
  if (!willSync) ntp_.stopWifiAndNtp();
  if (wake.userWake()) buttons_.holdWake();
  if (wake.previewWake) buttons_.showPreview();
  if (wake.keyWake && !wake.coldBoot) buttons_.primeKeyFromSetup();   // KEY z deep-sleep: mierz nacisniecie
  if (willSync) {
    ntp_.setRetries(timeFromRtc ? 2 : 3);   // pusty RTC: kilka szybkich prob, potem backoff
    ntp_.syncNow(SyncTrigger::Scheduled);
  }

  markDirty();
}

void App::loop() {
  watchdogFeed();
  buttons_.pollKey();
  buttons_.pollPreview();
  power_.enterNightSleepIfNeeded(false);

  if (web_.isActive()) web_.service();

  audio_.serviceAudio();
  audio_.serviceRinging();
  // Koniec dzwieku w czasie okna WWW/podgladu: idlePowerSave nie biega (busy),
  // wiec uspienie ES8311 i zdjecie podbicia CPU robimy tu — jedno miejsce dla
  // wszystkich sciezek konca odtwarzania. Przerwy miedzy powtorkami budzika
  // chroni audioActive() (ringing_ trzyma true).
  if (audio_.codecActive() && !audioActive()) audio_.shutdownCodec();
  battery_.update(false);
#if ENABLE_LOW_BATTERY_PROTECT
  power_.enterCriticalBatterySleepIfNeeded();
#endif
  bool ntpAdjustedTime = ntp_.service();
  // Okno spoznienia poszerzone o realny przestoj petli: dlugi handleClient (upload
  // MP3) ani 60 s light-sleep nie moga zgubic budzika z terminem w trakcie przestoju.
  uint32_t loopGapSec = lastAlarmCheckMs_ ? (millis() - lastAlarmCheckMs_) / 1000UL : 0;
  lastAlarmCheckMs_ = millis();
  uint32_t lateWindowSec = ntpAdjustedTime ? ntpcfg::ALARM_CATCHUP_SEC : alarmcfg::LATE_WINDOW_SEC;
  if (loopGapSec + alarmcfg::LOOP_GAP_MARGIN_SEC > lateWindowSec)
    lateWindowSec = loopGapSec + alarmcfg::LOOP_GAP_MARGIN_SEC;
  alarms_.checkAlarms(lateWindowSec);
  ntp_.checkSchedule();
  ntp_.handleRtcWriteRetry();
  display_.update();
  power_.idlePowerSave();
}

// ============================================================================
//  Punkty wejscia Arduino — cala logika w App.
// ============================================================================
void setup() { app.setup(); }
void loop()  { app.loop(); }
